[
  {
    "Opportunity ID": "UaekLsuROwWz3NQweMBi",
    "Opportunity Name": "351 N Rife St Aransas Pass TX 78336",
    "Property Address": "351 N Rife St",
    "Property city": "Aransas Pass",
    "State ": "TX",
    "zip code ": "78336",
    "Price ": "230000",
    "bedrooms": "4",
    "bathrooms": "1",
    "livingArea": "1210",
    "yearBuilt": "1966",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "",
    "down payment amount ": "15000",
    "down payment %": "",
    "Monthly payment": "2211",
    "lot sizes": "7000",
    "Image link": "https://photos.zillowstatic.com/fp/1eebd9afb62cdbc63207fedc3a5e7047-p_h.jpg",
    "description ": "!!SELLER FINANCING/RENT TO OWN!!!\nWelcome to 351 N Rife in Aransas Pass! This cozy 4-bedroom, 1-bath home offers 1,210 sq. ft. of updated living space with a warm, inviting feel. The beautifully updated kitchen features gorgeous new quartz countertops, complemented by matching finishes in the bathroom. One of the bedrooms is a garage conversion, offering a flexible space perfect for guests, a home office, or a playroom. The large backyard is ideal for gatherings, pets, or creating your own outdoor retreat. Conveniently located near schools, shopping, and local dining. Owner is open to seller financing and rent-to-own options, making this a great opportunity for buyers looking for flexibility and comfort in a great coastal location!",
    "New Description ": ""
  },
  {
    "Opportunity ID": "8nnESlkxY4KSE7cgJV3f",
    "Opportunity Name": "10009 Shane Dr Corpus Christi TX 78410",
    "Property Address": "10009 Shane Dr",
    "Property city": "Corpus Christi",
    "State ": "TX",
    "zip code ": "78410",
    "Price ": "230000",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1050",
    "yearBuilt": "2015",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "",
    "down payment amount ": "20000",
    "down payment %": "",
    "Monthly payment": "2160",
    "lot sizes": "15000",
    "Image link": "https://photos.zillowstatic.com/fp/2584f46d10d16fe39b27a7786508d94f-p_h.jpg",
    "description ": "Traditional lending, Seller-finance, and Rent to own options available\nDiscover comfort in this charming single-story home. Built in 2015, this 3-bedroom, 2-bath features an open-concept design with abundant natural light and modern finishes throughout. The spacious living area flows seamlessly into the dining room and kitchen, creating an ideal space for everyday living and entertaining. As the kitchen is equipped with ample cabinetry, generous countertop space, and a open layout for effortless cooking and hosting. The private primary suite includes a full ensuite bath, while two additional bedrooms provide versatility for guest or a home office.\nSituated on a generous 0.34-acre lot with no HOA, the property offers a large backyard with endless potential whether you envision a garden, play area, outdoor entertaining space, or future expansion. Enjoy the tranquility of a peaceful neighborhood while remaining just minutes from shopping, dining, parks, and convenient access to major roadways. Owner is open to seller finance and rent-to-own option, making this a great opportunity for buyers who are looking for flexibility and comfort.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "uXRMZ8aADBYnlMd1q4po",
    "Opportunity Name": "104 Twelve Oaks Rd Tullahoma TN 37388",
    "Property Address": "104 Twelve Oaks Rd",
    "Property city": "Tullahoma",
    "State ": "TN",
    "zip code ": "37388",
    "Price ": "489999",
    "bedrooms": "4",
    "bathrooms": "3",
    "livingArea": "2755",
    "yearBuilt": "1983",
    "homeType": "Single Family",
    "Balloon ": "10",
    "Interest rate ": "5",
    "down payment amount ": "",
    "down payment %": "25",
    "Monthly payment": "",
    "lot sizes": "36154",
    "Image link": "https://photos.zillowstatic.com/fp/00c193ff339377698499ecfcd0b8e7ed-p_h.jpg",
    "description ": "MOTIVATED SELLER- BRING ALL OFFERS! \nThis lovely property in sought after Tara Estates offers comfort and luxury. Situated on a 0.81-acre corner lot, this all-brick ranch home features four bedrooms and two and a half baths. The highlight is the 40x20 saltwater in-ground pool, perfect for relaxation. Inside, the den with a cozy fireplace is ideal for gatherings. Formal living room & separate dining room offer lots of space for entertaining family and friends. The 13x17 sunroom is finished, but not heated and cooled and opens to a covered deck, blending indoor and outdoor spaces. The property includes two semi-finished attic rooms, a storage building, and a two-car garage. With a new $26,000 architectural roof, this home combines upgrades with timeless appeal, all within a privacy-fenced lot. Possible owner financing for 80% loan, 20 years @ 1% under the going rate. Bring All Offers!",
    "New Description ": ""
  },
  {
    "Opportunity ID": "3blUFBDar3ApxsEnPHfG",
    "Opportunity Name": "314 S Hastings St Irving TX 75060",
    "Property Address": "314 S Hastings St",
    "Property city": "Irving",
    "State ": "TX",
    "zip code ": "75060",
    "Price ": "510000",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "3010",
    "yearBuilt": "1945",
    "homeType": "Single Family",
    "Balloon ": "15",
    "Interest rate ": "11",
    "down payment amount ": "250000",
    "down payment %": "",
    "Monthly payment": "",
    "lot sizes": "12763",
    "Image link": "https://photos.zillowstatic.com/fp/92cd037d804015b8f893ace5877c29fa-p_h.jpg",
    "description ": "Step into this beautifully updated Heritage District gem in Irving — offering 3 beds, 2 baths, 2 spacious living rooms—both with soaring vaulted ceilings. Large back living room is ideal for entertaining. Upstairs flex studio adds versatility. Natural light pours through expansive windows. Updates include windows, flooring, paint, foundation, HVAC, roof & more! Enjoy a long driveway, gas cooking, and unbeatable location. Close to dining, shopping, and highways for easy commute. Schedule a tour today!\nOwner finance available: $350k down, up to 15 years at 11% interest. $1,819 monthly",
    "New Description ": ""
  },
  {
    "Opportunity ID": "mkz8bQzeztNqUAYX7mD5",
    "Opportunity Name": "418 McDougal Ave San Antonio TX 78223",
    "Property Address": "418 McDougal Ave",
    "Property city": "San Antonio",
    "State ": "TX",
    "zip code ": "78223",
    "Price ": "220000",
    "bedrooms": "3",
    "bathrooms": "1",
    "livingArea": "816",
    "yearBuilt": "1940",
    "homeType": "Single Family",
    "Balloon ": "2",
    "Interest rate ": "",
    "down payment amount ": "",
    "down payment %": "10",
    "Monthly payment": "1740",
    "lot sizes": "5000",
    "Image link": "https://photos.zillowstatic.com/fp/ed391c383b8be259d37e160b78f5ecdc-p_h.jpg",
    "description ": "Owner Financing Available – Investor Opportunity! Foreign nationals are welcome.\nSales Price: $220,000 USD with only 10% down. Attractive financing terms at 10% interest for the first 2 years, followed by 11.99% with a 5-year balloon. Strong potential as a rental property or portfolio addition, offering stable returns and long-term value.\n\nBeautifully renovated 3-bedroom, 1-bath home featuring a spacious front and backyard. The updated kitchen offers ample cabinet space, granite countertops, refrigerator, and electric stove. An open family and dining room combination provides the perfect setting for entertaining. Enjoy brand-new wall A/C units, hardwood flooring throughout, and ceiling fans with remotes in every room. Washer/dryer hookups are included for convenience. Outside, you’ll find covered parking and a long driveway with room for multiple vehicles. With plenty of outdoor space and a location close to shopping, dining, and banking, this home is move-in ready and waiting for you. \n\nFinanciamiento del propietario disponible – ¡Oportunidad para inversores! Se da la bienvenida a ciudadanos extranjeros. Precio de venta: $220,000 USD con solo un 10% de enganche. Condiciones de financiamiento atractivas al 10% de interés durante los primeros 2 años, seguido de 11.99% con un pago global a 5 años. Gran potencial como propiedad de alquiler o adición a su portafolio, ofreciendo rendimientos estables y valor a largo plazo.\nHermosa casa renovada de 3 habitaciones y 1 baño, con un amplio jardín delantero y trasero. La cocina actualizada ofrece amplios gabinetes, encimeras de granito, refrigerador y estufa eléctrica. Una combinación de sala familiar y comedor abierta proporciona el entorno perfecto para entretener. Disfrute de unidades de aire acondicionado nuevas, pisos de madera en toda la casa y ventiladores de techo con control remoto en cada habitación. Se incluyen conexiones para lavadora y secadora para mayor comodidad. En el exterior, encontrará estacionamiento cubierto y un largo camino de entrada con espacio para varios vehículos. Con mucho espacio al aire libre y una ubicación cercana a tiendas, restaurantes y bancos, esta casa está lista para mudarse y esperándole.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "vN2SmLoPPDUVfcXltmwl",
    "Opportunity Name": "19350-8 A St SW Norman OK 73072",
    "Property Address": "19350-8 A St SW",
    "Property city": "Norman",
    "State ": "OK",
    "zip code ": "73072",
    "Price ": "110000",
    "bedrooms": "2",
    "bathrooms": "1",
    "livingArea": "800",
    "yearBuilt": "1970",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "12",
    "down payment amount ": "",
    "down payment %": "10",
    "Monthly payment": "",
    "lot sizes": "36154",
    "Image link": "https://photos.zillowstatic.com/fp/373fe2adebca7f97018ff76f20a061e6-p_h.jpg",
    "description ": "The perfect Norman retreat with Little Axe Schools. Discover your fresh start in this completely remodeled 2-bed, 1-bath home, designed for simple and modern living. Imagine enjoying your morning coffee on your almost one-acre property, with all the latest updates inside. From the brand-new roof and stylish flooring to the fresh paint and appliances, every detail has been thoughtfully updated. The small carport adds a touch of convenience. The owner is flexible regarding the mobile home on the property, which can be purchased separately or removed before closing. Don't miss this opportunity—call to schedule a showing.\nOwner will Finance with 10% down",
    "New Description ": ""
  },
  {
    "Opportunity ID": "8y9c85XVNw2bHhfhcbFo",
    "Opportunity Name": "5955 S Mountain View Rd Fort Mohave AZ 86426",
    "Property Address": "5955 S Mountain View Rd",
    "Property city": "Fort Mohave",
    "State ": "AZ",
    "zip code ": "86426",
    "Price ": "349900",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1625",
    "yearBuilt": "2024",
    "homeType": "Single Family",
    "Balloon ": "2",
    "Interest rate ": "",
    "down payment amount ": "25000",
    "down payment %": "",
    "Monthly payment": "1700",
    "lot sizes": "6200",
    "Image link": "https://photos.zillowstatic.com/fp/9920d1c057c177155d6360e4804bbb4f-p_h.jpg",
    "description ": "Brand new home for sale by owner on 12th green of Hukan golf club. Owner Financing . payment apps $1700.00 per month.\n\nNew home for sale by owner, Owner financinng, payment appx $1700.00 per month.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "C1IAcgvPvfCPq8YA2fDf",
    "Opportunity Name": "5104 Springfield Ave NW Roanoke VA 24017",
    "Property Address": "5104 Springfield Ave NW",
    "Property city": "Roanoke",
    "State ": "VA",
    "zip code ": "24017",
    "Price ": "175000",
    "bedrooms": "2",
    "bathrooms": "1",
    "livingArea": "1023",
    "yearBuilt": "1941",
    "homeType": "Single Family",
    "Balloon ": "5",
    "Interest rate ": "6",
    "down payment amount ": "6000",
    "down payment %": "",
    "Monthly payment": "",
    "lot sizes": "14374",
    "Image link": "https://photos.zillowstatic.com/fp/7698081e2537c2834b970241f20a8e09-p_h.jpg",
    "description ": "Owner Financing  & For Sale by Owner Cottage style home. Hard wood floors   Close to Lake Side shopping plaza. \nLarge corner lot.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "EBiYyiHeEztrlBtF9xWC",
    "Opportunity Name": "123 Coyote Willow Dr Etna OH 43068",
    "Property Address": "123 Coyote Willow Dr",
    "Property city": "Etna",
    "State ": "OH",
    "zip code ": "43068",
    "Price ": "300000",
    "bedrooms": "4",
    "bathrooms": "2",
    "livingArea": "2300",
    "yearBuilt": "2021",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "10",
    "down payment amount ": "",
    "down payment %": "10",
    "Monthly payment": "",
    "lot sizes": "15245",
    "Image link": "https://photos.zillowstatic.com/fp/a7a1a40ba83b8fbaeb458e92e8bb242f-p_h.jpg",
    "description ": "?? For Sale by Owner – Owner Financing Available!\n123 Coyote Willow Dr., Etna, OH 43018\n\nSale Price: $300,000 | Down Payment: 10% | Interest: 9.9% | Term: 30 Years | NO BANKS REQUIRED!\n\n?? Own This Beautiful Home Without a Bank!\n\nTired of strict lender requirements? This is your chance to own a home directly from the owner with easy, flexible financing!\nLocated in the desirable Etna Township area just minutes from I-70 and a short drive to Columbus, this well-maintained home offers the perfect blend of comfort, space, and small-town charm.\n\n?? Property Features\n\n4 Bedrooms, 3 Bathrooms\n\nSpacious open-concept floor plan with abundant natural light\n\nModern kitchen with stainless-steel appliances, large island, and pantry\n\nOwner’s suite with walk-in closet and private bath\n\nFinished basement with full bath — great for entertainment or guests\n\nAttached 2-car garage and large driveway\n\nPrivate backyard with deck and room for gardening or play\n\nNewer roof, HVAC, and windows — move-in ready condition\n\n?? Prime Location\n\nPeaceful, family-friendly neighborhood\n\nEasy access to Pataskala, Reynoldsburg, and Columbus\n\nNearby shopping, restaurants, and parks\n\nExcellent schools and growing community\n\n?? Owner Financing Details\n\nPurchase Price: $300,000\n\nDown Payment: $30,000 (10%)\n\nLoan Amount: $270,000\n\nInterest Rate: 9.9% fixed\n\nTerm: 30 years (no balloon payment)\n\nApproximate Monthly Payment: ~$2,330 (principal & interest only)\n\nNo banks, no credit hurdles — fast and simple closing directly with the owner!\n\n?? Contact the Owner Directly\n\nCall or text Alana at 614-407-6324\nOr email alana.rainandshine@gmail.com to schedule a private showing.\n\n?? Why This Home?\n\n? Move-in ready\n? Affordable monthly payments\n? Long-term, fixed-rate owner financing\n? Bypass traditional lenders — you deal directly with the owner\n\nDon’t wait! Homes in Etna with owner financing are rare.\nCome see 123 Coyote Willow Dr. today and make it yours — no banks required!",
    "New Description ": ""
  },
  {
    "Opportunity ID": "Qwa1V8QIyxlvuZ8gjwvW",
    "Opportunity Name": "1011 Runyon Dr Alberton MT 59820",
    "Property Address": "1011 Runyon Dr",
    "Property city": "Alberton",
    "State ": "MT",
    "zip code ": "59820",
    "Price ": "299999",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1440",
    "yearBuilt": "1972",
    "homeType": "Single Family",
    "Balloon ": "5",
    "Interest rate ": "6.8",
    "down payment amount ": "100000",
    "down payment %": "",
    "Monthly payment": "",
    "lot sizes": "20037",
    "Image link": "https://photos.zillowstatic.com/fp/a8ebb8e3a41ae672efcf2af154b037a2-p_h.jpg",
    "description ": "Sitting on nearly a half-acre with water rights to Petty Creek, this 3-bedroom, 2-bathroom home in Alberton is ready for its next chapter. Enjoy the convenience of a detached shop, an RV hook-up with amp service, and exterior wiring perfect for heating your truck or recreational toys in the colder months.\nInside, you’ll find a spacious open layout with a generous living room and kitchen, plus brand-new appliances, washer, and dryer already in place.\nStep outside to relax on either of the two covered porches, or take a quick 2-minute walk to the Clark Fork River boat ramp—the perfect spot to fish, float, or simply enjoy time by the water.\nWith room to spread out, modern upgrades, and versatile outdoor amenities, this property combines practicality with charm—all just a short drive from Missoula. Sellers have upgraded all electrical work from the previous inspection when they purchased the home, new carpet, and added a walk-in shower in the en-suite bathroom. They are also offering a $1,000 flooring credit to address pet damage on parts of floor. \nNote: Home is not on a permanent foundation. Sellers are willing to offer owner financing with the right amount down.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "LbRa3aL80MWxR6IBQW8m",
    "Opportunity Name": "4259 Dairy Farm Rd Panama City FL 32404",
    "Property Address": "4259 Dairy Farm Rd",
    "Property city": "Panama City",
    "State ": "FL",
    "zip code ": "32404",
    "Price ": "329900",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1501",
    "yearBuilt": "2008",
    "homeType": "Single Family",
    "Balloon ": "2",
    "Interest rate ": "",
    "down payment amount ": "",
    "down payment %": "10",
    "Monthly payment": "2450",
    "lot sizes": "9147",
    "Image link": "https://photos.zillowstatic.com/fp/0f16b26675162a908081bc2111ddf757-p_h.jpg",
    "description ": "BEST DEAL in Bylsma Manor Estates - With NO HOA! HURRY - This stunning 3-bed/2-bath home is the lowest-priced gem in one of Panama City's most desirable, well-maintained neighborhoods and it's priced to sell FAST. This is a prime, central location home, just minutes from top schools, shopping, beaches, and HWY 231, allowing for easy regional and local access. This quiet and safe neighborhood, with tree-lined streets, boast pride of ownership. Perfect neighborhood to walk the dog and or walk with the family. As you step inside, you'll notice the many custom upgrades everywhere. Soaring vaulted ceilings in the living room elegant trey ceilings in all bedrooms, ceramic tile throughout the living areas; rich wood-look flooring in bedrooms & master bath. Gourmet kitchen with stainless steel appliances featuring upgraded custom cabinetry and Corian countertops with tile backsplash. The Living room centers a cozy electric fireplace - perfect for movie nights or quiet evenings. Also the home features a bright, airy Florida sunroom bathed in natural light - a plant lover's dream. Your private outdoor oasis awaits in the fully fenced backyard, which is backing up to a serene nature preserve. The yard features an expansive patio with a custom pergola (wired for lights & outlets!) and a outdoor shower for post-beach rinses, or after yard work. This area is ideal for stargazing, BBQs, or unwinding in peace and quiet. This isn't just a house it's a move-in-ready retreat with rare custom finishes in a family-friendly, low-maintenance community. Don't wait - homes like this don't last. Schedule your private tour TODAY before it's gone!\nSeller may consider Owner Financing with 10% Down Payment Addl.Terms to Discuss",
    "New Description ": ""
  },
  {
    "Opportunity ID": "Y7QwhpOzksqhk0QAt0dC",
    "Opportunity Name": "294 Eagle Dr Big Bear Lake CA 92315",
    "Property Address": "294 Eagle Dr",
    "Property city": "Big Bear Lake",
    "State ": "CA",
    "zip code ": "92315",
    "Price ": "399000",
    "bedrooms": "2",
    "bathrooms": "1",
    "livingArea": "749",
    "yearBuilt": "1944",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "",
    "down payment amount ": "120000",
    "down payment %": "",
    "Monthly payment": "3500",
    "lot sizes": "6000",
    "Image link": "https://photos.zillowstatic.com/fp/10a902c4eb02c17e62dc65d38062b3e9-p_h.jpg",
    "description ": "Welcome to 294 Eagle Dr in the Eagle Point neighborhood of Big Bear Lake, CA! Incredible opportunity to move in, landlord, or AirB&B this upgraded & turnkey, 2 bedroom, 1 bathroom mountain cabin - with parking for 2 vehicles plus RV parking (or 2 additional vehicles), expansive & elevated back deck, quarry rock fireplace & chimney, 6000 sq foot lot with soaring pines, park/playground frontage, and just 2 blocks from the beach and lake! Income potential of $49K per year, based on surrounding, 2 bedroom, 1 bathroom AirB&Bs, and for sale for $50K below pre-appraised value of $450K for a quick sale! And with million-dollar homes as neighbors! Offers due Monday 11/3 by 5PM. Seller may carry purchase or lease-to-own with the right terms.\nAll new everything including new interior & exterior paint, new high-end stainless-steel appliances (including gas oven/stove & laundry washer/dryer), new scratch-resistant luxury-vinyl plank flooring throughout, new plumbing - mainline & fixtures including toilet, new grounded outlets, new recessed & evening lighting - inside & out, new wood sanding & staining - inside & out, new concrete foundation walls & surrounding cement including new stairs & railing, and newer roof, water-heater, and double-paned windows. Expansive storage & workshop space under the home, as well as additional enclosed storage under the deck for equipment and/or park, lake & snow toys. Make your downpayment back in 3-4 years with AirB&B, while enjoying the incredible amenities of the Eagle Point peninsula, as well as the surrounding community.\nAll available within 2 blocks from the property: large park with trees and open meadows, 2 playgrounds, swimming beach & fishing lake, sports courts & fields (sand volleyball, basketball, tennis, pickleball,, softball, baseball), and free city trolley to the new Big Bear Zoo, 9-Hole Golf Course & Clubhouse, Big Bear Village, Bear Mountain & Snow Summit Ski Resorts, Marina, the North Shore & more! Host visitors or personally enjoy one of Southern California's only 4-season resorts with watersports - boating, fishing & swimming; snowsports - skiing, sledding, tubing, snowboarding, skating & snowshoeing; mountain sports - biking, birding, & hiking; movie theater, music venues, restaurants, shopping, and year-round events & festivals. Per appraiser, this property is unmatched in upgrades compared to other similar cabins throughout Big Bear Lake. View and make your offer ASAP! This property will sell quickly.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "tO8vwHUfNUb1ZM9wbDd5",
    "Opportunity Name": "1357 Tahoe Dr Lewisville TX 75067",
    "Property Address": "1357 Tahoe Dr",
    "Property city": "Lewisville",
    "State ": "TX",
    "zip code ": "75067",
    "Price ": "310000",
    "bedrooms": "4",
    "bathrooms": "2",
    "livingArea": "1450",
    "yearBuilt": "",
    "homeType": "Single Family",
    "Balloon ": "",
    "Interest rate ": "6.5",
    "down payment amount ": "",
    "down payment %": "10",
    "Monthly payment": "",
    "lot sizes": "0",
    "Image link": "https://photos.zillowstatic.com/fp/f5df2b292ea755dd7393b3e929549491-p_h.jpg",
    "description ": "For lease with option to purchase. Newly renovated nice 4 bdrm 2 bath on a large corner lot. New flooring, paint, roof, appliances, water heater, fencing etc. Home is available now. Home is close to schools, and shopping. Everything has been done no need to worry about repairs. There is ample parking at front drive and street.\nCall for more info today.\n\nOwner responsible for yardwork",
    "New Description ": ""
  },
  {
    "Opportunity ID": "X4An0vm3MU6FeUTqZKdO",
    "Opportunity Name": "3221 George Ave Forest Hill TX 76119",
    "Property Address": "3221 George Ave",
    "Property city": "Forest Hill",
    "State ": "TX",
    "zip code ": "76119",
    "Price ": "350000",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1705",
    "yearBuilt": "2020",
    "homeType": "Single Family",
    "Balloon ": "10",
    "Interest rate ": "10",
    "down payment amount ": "",
    "down payment %": "15",
    "Monthly payment": "",
    "lot sizes": "8929",
    "Image link": "https://photos.zillowstatic.com/fp/bd218b510002f7228ab50c361ddc52da-p_h.jpg",
    "description ": "*Owner financing only*\nWelcome to 3221 George Ave, a stunning modern home built in 2020 and thoughtfully upgraded with custom features throughout. This residence combines contemporary design with everyday functionality, offering a layout and finishes that stand out from the rest. Step inside to an open-concept living space centered around a designer kitchen featuring a waterfall island, custom cabinets, and decorative lighting. The kitchen flows seamlessly into the dining and living areas, creating the perfect setting for entertaining and gatherings. The spacious primary suite is privately tucked away from the secondary bedrooms, providing a quiet retreat. It features a spa-inspired ensuite bath and custom closets designed for maximum organization. Additional bedrooms are generously sized, each offering comfort and style. Upgrades extend throughout the home, with attention to detail evident in the finishes and lighting. A covered patio opens to a large backyard, perfect for outdoor living, grilling, or simply relaxing in your own space. With its modern construction, custom upgrades, and inviting layout, this home is move-in ready and designed to impress. Conveniently located in Forest Hill, you’ll enjoy easy access to schools, parks, shopping, and major highways for a quick commute throughout DFW.",
    "New Description ": ""
  },
  {
    "Opportunity ID": "N1pwdRzxUyjhrAwcREWR",
    "Opportunity Name": "923 Belvedere Street Rocky Mount NC 27803",
    "Property Address": "923 Belvedere Street, Rocky Mount, NC 27803",
    "Property city": "Rocky Mount",
    "State ": "nc",
    "zip code ": "27803",
    "Price ": "155000",
    "bedrooms": "3",
    "bathrooms": "2",
    "livingArea": "1548",
    "yearBuilt": "1910",
    "homeType": "SINGLE_FAMILY",
    "Balloon ": "5",
    "Interest rate ": "6",
    "down payment amount ": "",
    "down payment %": "20",
    "Monthly payment": "",
    "lot sizes": "7405",
    "Image link": "https://photos.zillowstatic.com/fp/723da486cfacaadc4f0b81641eff915f-cc_ft_1344.webp",
    "description ": "Beautifully renovated 3-bedroom, 2-bathroom residence offering 1,548 square feet of modern living space. From the moment you step inside, you'll be captivated by the thoughtful updates and high-quality finishes throughout.\n\nThis home offers brand-new LVP flooring, fresh interior paint, and new fixtures, giving it a fresh, contemporary feel. The kitchen has been completely updated with sleek new quartz countertops and new appliances, ready to inspire your culinary creations.\n\nEnjoy peace of mind with a new HVAC system, a 10-year warranty (10 years on parts), and all-new ductwork. The new windows and metal flashing installed around the exterior enhance durability and curb appeal while filling the interior with natural light.\n\nSchedule your showing today!\nAlternatively Seller Financing Available!",
    "New Description ": ""
  }
]