[
  {
    "id": "0540P3giKN8kJ2M8Rzri",
    "address": "3103 Shed Rd, Bossier City, LA 71111",
    "description": "Cute home renting for $1,100. Repainted with new waterproof LVP flooring, new range with a large shed outside. Also new insulation and new fixtures. Great condition!\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 3103 Shed Rd (MLS 21106161), and 116-118 Loop St (MLS 21104689). No owner fin",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 87900,
    "source": "apify-zillow"
  },
  {
    "id": "0F8TJPYmSZQaJONVme8V",
    "address": "73 W Westward Ave, Blakely, GA 39823",
    "description": "Welcome to this charming 3-bedroom, 1-bath single-family home conveniently located in the heart of Blakely, GA. Offering just under 1,000 square feet of comfortable living space, this move-in ready home has been freshly repainted inside and out and features low-maintenance finishes throughout. Step inside to find an inviting living area with cohesive flooring that flows seamlessly into a bright, functional kitchen equipped with a refrigerator, microwave and range. The bathroom has been refreshed",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 99000,
    "source": "apify-zillow"
  },
  {
    "id": "1W37ZQ8FmrEcY17mBYzv",
    "address": "4874 Larkspur Ln S, Atlanta, GA 30349",
    "description": "Look no further, this gorgeous 3-bedroom 2-bathroom ranch on a corner lot can be your dream home. It has a large family room with a fireplace, this amazing home is located in the highly sought after Creekside Subdivision. It features a large master bedroom, master bath, Jacuzzi tub, separate shower, double vanity, and walk in closet. The kitchen has an eat in breakfast area, stainless steel appliances and laundry closed for both gas and electric dryer. A beautiful new roof was just completed on ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 260000,
    "source": "apify-zillow"
  },
  {
    "id": "25K8fzx3dqXkptNm6qFB",
    "address": "14885 Winthrop St, Detroit, MI 48227",
    "description": "OPORTUNITY!!! Great investment property. This brick bungalow has potential, curb appeal. This house is located in a great block and it is in a really good shape with 3 bedrooms, 1.5 bath, basement and detached garage. It is tenant occupied living there since  Feb 2023. Rent paid by SEC8, the rent is $1,150.00 and it is up to date.\nFOR SHOWING PLEASE CONTACT LISTING AGENT AND SET UP AN APPOINTMENT.\nNO SELLER FINANCING.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 90000,
    "source": "apify-zillow"
  },
  {
    "id": "2B6NpSroC9ZMkcVoCuxy",
    "address": "10564 Heirloom Rd, Mobile, AL 36608",
    "description": "This immaculately kept 2024 Gold Fortified, 1706 sq ft Lamar split floor-plan with 3 beds 2 baths is waiting for you to make a new home! Beautiful quartz countertops, white cabinets, stainless steel appliances, and an all in sink that sits in the center of the island is all open to the living and dinning rooms. Smart Home Technology lets you stay connected with a peace of mind using a smart phone or tablet. Move in ready and yard backs up to woods making it extra private. Call your favorite Real",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 330000,
    "source": "apify-zillow"
  },
  {
    "id": "2DTxwJht0Na0xPXO656b",
    "address": "641 State Route 110, Tunbridge, VT 05077",
    "description": "Affordable 3BR/2BA on 1.75 Acres Fenced Yard, Porch & Pellet Stove Backup (Tunbridge, VT)\nPrice: $179,000 (or best reasonable offer)\nAddress: Tunbridge, VT (on main road)\nType: 1998 doublewide manufactured home on a cement slab\nSize: 1,200 sq ft Lot: 1.75 acres\nBeds/Baths: 3 bed 2 bath\nHeating: Oil heat pellet stove (backup)\nUtilities: Tile well 1,000-gal septic with leach field\nRecent Updates: Hot water heater, refrigerator, stove\nOutdoor: Large fenced yard (great for play area & pets) Covered ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 179000,
    "source": "apify-zillow"
  },
  {
    "id": "2S8vJveW65ltcZzrrXld",
    "address": "358 Fairview Ave #1438, Long Valley, NJ 07853",
    "description": "Set on 1.19 acres, this property presents a strong opportunity for investors, contractors, or buyers seeking a full renovation project. The home requires a complete rehab and currently has no kitchen and no working plumbing, offering a clean slate for redesign or redevelopment. A detached barn adds additional potential. Recent septic updates. Seller Financing is available. Cash only",
    "negativeKeywords": [
      "cash only"
    ],
    "price": 379000,
    "source": "apify-zillow"
  },
  {
    "id": "3IWcqukAyEePvbX1hItZ",
    "address": "620 N Miller St, Clarksville, AR 72830",
    "description": "This 2 bed/ 1 bath house is located on a corner lot within walking distance of the University of the Ozarks. The house has a fenced in back yard, detached garage & a sunroom. The house even comes with a washer/dryer. \n\n\nNo owner financing! ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 139000,
    "source": "apify-zillow"
  },
  {
    "id": "3xG3ttiG1dCJ4sjTUVo5",
    "address": "26206 Kitch St, Inkster, MI 48141",
    "description": "OPORTUNITY!!! Gets on the market this gem in a perfect location. This nice brick contemporary house is located in a great area. It is a nice residential area but near to main streets, schools, stores, and shopping centers. This is an excellent property for investors, fix up buyers or anyone who would like to take the opportunity to get this house. You will find a nice size living, dinning, 1/2 bath on the lower level, and then 3 bedrooms, 1 full bath upstairs, driveway and garage detached. Furna",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 88000,
    "source": "apify-zillow"
  },
  {
    "id": "4Fxe1IGDfkoYMUOxXN1y",
    "address": "26206 County Road 1512, Allen, OK 74825",
    "description": "Acres: 6.5 Acres. Price: $299,950. Terms: No owner financing. Location: 26206 County Road 1512, Allen, OK 74825, Pontotoc, County. 7 miles southwest of Allen, OK and 11 miles east of Ada, OK. Comments: Country living close to Ada, OK. Located off County Rd 1512. Home has recently been renovated with new flooring, paint, appliances, kitchen cabinets and more. Ready to move in! Improvements: Completely renovated 2,100-square-foot home. Home offers 4-bedrooms, 2- bathrooms, breakfast island, stone ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 299950,
    "source": "apify-zillow"
  },
  {
    "id": "4WZiyVDdxBxjIiA1zNfE",
    "address": "878 E 130th St, Cleveland, OH 44108",
    "description": "Lovely and affordable and updated 3 bedroom colonial. Beautiful serene decor with luxury vinyl tile flooring throughout. White kitchen cabinetry with gorgeous countertops. Marble tiled surround in the bathroom. Newer carpet in all bedrooms. Spacious 3rd bedroom on third level. Contemporary ceiling fans and light fixtures throughout. Glass block windows and security doors. Newer furnace, hot water tank and updated electrical. Fenced in yard and ample space for entertaining.\nNo seller financing, c",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 109900,
    "source": "apify-zillow"
  },
  {
    "id": "4YXnbshroV9zf4PSZduK",
    "address": "2540 Malone Ave, Memphis, TN 38114",
    "description": "INVESTERS ONLY!! Tenant occupied super cute 2Bed 1Bath home with low maintenance exterior and large detached workshop! Rent is $890/mo. Home will be a great addition to your portfolio and is professionally managed by Reedy and Company. This home was rehabbed within the last 18 months before the current tenant moved in. It has new interior paint, new exterior paint, nice looking roof (with no known issues), nice floor plan with new carpet, updated bathroom and kitchen, light fixtures that have be",
    "negativeKeywords": [
      "no owner financing",
      "no creative financing"
    ],
    "price": 95000,
    "source": "apify-zillow"
  },
  {
    "id": "4f5rfaHXCRQmncyX1CnV",
    "address": "6390 Harding St, Hollywood, FL 33024",
    "description": "Good opportunity to be in the middle of Hollywood in a great neighborhood. 3 beds 1 bath in a great area. Big lot. No leaks but roof is 10 . Additional terms must include that a hold harmless to be signed. Offer must be at asking price. NO ASSIGNABILITY, No owner finance, No subject to existing payment offers will be considered. CASH ONLY",
    "negativeKeywords": [
      "cash only"
    ],
    "price": 450000,
    "source": "apify-zillow"
  },
  {
    "id": "62rVoIYPVQljs65NO84l",
    "address": "271 E Linden St, Shreveport, LA 71104",
    "description": "This great property rents for $910 per month and has updated exterior, wood floors and a great fenced yard.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 3103 Shed Rd (MLS 21106161), and 116-118 Loop St (MLS 21104689). No owner financing or creative finance is offered with this package",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 79900,
    "source": "apify-zillow"
  },
  {
    "id": "7LVQcP1JqAO24LCG1Bey",
    "address": "10704 Willow Ave, Poncha Springs, CO 81242",
    "description": "Hello! We are selling our better-than-new house in Poncha Meadows. It was just freshly painted, windows and carpets professionally cleaned, and it s ready for its new family. 1365 square feet, detached 2-car garage, small mostly-landscaped back fenced back yard, best neighbors ever! Built in 2022: 3 bedrooms, 2 baths, open concept, separate laundry room. Lots of upgrades added to what builders did: Bosch gas stove, custom plantation shutters, extra shelves, cabinetry, marble backsplashes, laundr",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 575000,
    "source": "apify-zillow"
  },
  {
    "id": "8Fv3FuBL5iYqPKnvxfZe",
    "address": "15901 Pythias Ave, Cleveland, OH 44110",
    "description": "Investor special! 15901 Pythias Ave sits in Cleveland s up-and-coming Waterloo Arts District just minutes from Lake Erie and local amenities. This solid, low-maintenance home offers great cash flow potential with CMHA currently paying $1,479/month.\nInside, you ll find a first-floor bedroom with a convenient half bath, spacious living and dining areas, and a kitchen with appliances all updated within the past 3 years. The carpet throughout the entire home is also less than 3 years old and in perf",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 115000,
    "source": "apify-zillow"
  },
  {
    "id": "9ER2tf65kR9XGfmlMTad",
    "address": "102 W Virginia St, Arcadia, FL 34266",
    "description": "Spacious and updated 2-story, 4-bedroom, 2-bath home situated on nearly one acre with mature trees and a private backyard. Main level features a remodeled kitchen, updated laundry room, original hardwood floors, high ceilings in living and dining areas, 1 bedroom, and 1 fully remodeled bathroom with walk-in shower. Upper level offers 3 additional bedrooms and 1 full bath. Recent updates include new roof, new siding, and updated electric and plumbing. Ample natural light throughout with large win",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 259000,
    "source": "apify-zillow"
  },
  {
    "id": "9s61qe2ZHUU9xFTnOWY4",
    "address": "1507 Viosca St, Bossier City, LA 71111",
    "description": "This adorable home is rented for $1,180 per month. New AC, new waterproof LVP. Large covered porch\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 3103 Shed Rd (MLS 21106161), and 116-118 Loop St (MLS 21104689). No owner financing or creative finance is offered with this package",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 94900,
    "source": "apify-zillow"
  },
  {
    "id": "ATGA08wWZkolcCAFMS3q",
    "address": "234 College St, Blakely, GA 39823",
    "description": "Buyers' loss is your gain! Still available at no fault of the home itself, this historic 1886 Southern home blends timeless charm with endless potential. Stepping inside, you're immediately captivated by the grandeur of the 12-foot ceilings and the impressive 8-foot-wide foyer. Registered on the National Register of Historic Places in Georgia, this nearly 3,000-square-foot home beautifully blends historic character with functional living. Off the foyer, you'll find four spacious rooms, each boas",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 239900,
    "source": "apify-zillow"
  },
  {
    "id": "Ap58sfwRDJ6vhOTdlTPt",
    "address": "94296 Horton Rd, Blachly, OR 97412",
    "description": "5.79 acres with 2 bedroom fixer in Lane County. Steps from Lake Creek! Affordable property in this area does not come around very often. RLID shows FEMA flood hazard zone X outside of 500 year flood. Cash, hard money, or cash from HELOC from owner occupied property only. Sorry no owner carry. Go past first cedar shake building on the left all the way down to the end of the road to the house on the right. No interior access to the home until it is under contract. Please call your agent for a show",
    "negativeKeywords": [
      "no owner carry"
    ],
    "price": 149900,
    "source": "apify-zillow"
  },
  {
    "id": "CHwwOrFlrPa4QHaA179I",
    "address": "414 Daytona St, Daytona Beach, FL 32114",
    "description": "NO OWNER FINANCING.. NO NEED FOR REALTOR..\nFamily Compound. All originally built in 1926. Craftsman style 2/1 House and three 1/1 cottages. Addresses 414, 416, 418 and 420. All have separate utilities and two of the cottages are fully furnished for airbnb. Located in Downtown Daytona Beach redevelopment area with lots of growth around. Framework Apartments and downtown parking garage being built across the street. 1.2 miles to boardwalk and Beach, across the street from the river and Riverfront ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 246277,
    "source": "apify-zillow"
  },
  {
    "id": "CThyrhnbKSzHmE8KQ3EZ",
    "address": "2610 Derbyshire Ave, Memphis, TN 38127",
    "description": "INVESTORS ONLY! Tenant Occupied property that is currently rented at $939/mo. Professionally managed. This can be a great addition to your investment portfolio. (Lease, Ledger available upon request.) No Sign, Make all offers contingent on interior inspection, no Wholesalers, no Assignments, no owner financing or subject to offers will be considered.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 95000,
    "source": "apify-zillow"
  },
  {
    "id": "GmiulfLlmYNCifcJLiea",
    "address": "107 Morse St, Van Buren, ME 04785",
    "description": "NO OWNER FINANCING Bring your realtor. Seller will pay up to 3% realtor fee.\nVideo walk through available, if needed.\nLooking to downsize, Or need a great starter home. This is it.\nThis 2 bedroom 1 bath and sits on over half acre on edge of town. 12 12 Workshop/Storage with electric.. Southern facing deck.\nSolar post lights at rear gate invites you to the firefit, where you'll find plenty of room for entertaining. Huge lot for all your toys and any additions if you want. Remote control attached ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 159000,
    "source": "apify-zillow"
  },
  {
    "id": "HE8RA8xIEkREPF4lQ5gH",
    "address": "15 Dixie Dr, Stockbridge, GA 30281",
    "description": "Welcome to this charming single-story home in Stockbridge, Georgia! Built in 1962, this cozy residence features three comfortable bedrooms and one full bathroom across 864 square feet of living space. Nestled on a generous 0.7-acre lot, the property includes a three-space carport, a detached shed, and both a small wooden porch and a cement patio, perfect for outdoor relaxation. With connections for gas, water, and power, this home is ready for your personal touch and updates. While it does need ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 115000,
    "source": "apify-zillow"
  },
  {
    "id": "HQ06oKjz2aiNx3Pmv4r3",
    "address": "3792 Dunn Ave, Memphis, TN 38111",
    "description": "INVESTERS ONLY! Tenant occupied lovely 2Bed 1Bath home in East Memphis. Rent is $895/mo. Home was rehabbed within the last 18 months before the current tenant moved in. Seller installed new central A/C, new water heater, new interior/exterior paint, updated tile floors, new bathroom fixtures, refinished hardwood floors, new countertops, new light fixtures, plus huge backyard. Could be a great addition to your portfolio and is professionally managed by Reedy and Company. Cash or conventional offe",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 105000,
    "source": "apify-zillow"
  },
  {
    "id": "I5DqAslHtIwgvEFo9g2K",
    "address": "3021 Stone Mountain St, Lithonia, GA 30058",
    "description": "Welcome home to timeless charm in Lithonia, GA!    Step into history with this beautifully refreshed four-bedroom, two-bath home built in 1910, where classic Southern elegance meets modern comfort. From the moment you arrive, the grand two-story columns on the front patio invite you to slow down, breathe in the quiet, and imagine life unfolding here.    Inside, you’ll be greeted by freshly painted interiors, plantation shutters, and three fireplaces that add a cozy touch of vintage charm. The br",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 330000,
    "source": "apify-zillow"
  },
  {
    "id": "IOzsZJS1hSQFbbJ0Lf4I",
    "address": "308 Walter Chambers St, Eden, NC 27288",
    "description": "Beautiful older home, move in ready on a 90x150 ft. level lot. Interior completely renovated with all new appliances, cabinets and countertops in kitchen. New flooring throughout and new light fixtures and ceiling fans. Bathroom upgrades, and new washer and dryer also. Great location only five minutes from schools, restaurants, shopping areas, doctors offices and hospital. This home is for sale only with no owner financing or rent to own options.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 170000,
    "source": "apify-zillow"
  },
  {
    "id": "IcCtBsHGf66nhepWCjZK",
    "address": "286-96 Lower Nis Hollow Dr, Lehighton, PA 18235",
    "description": "All reasonable offers will be considered!!!\nLARGE double wide mobile home located in nis hollow estates in lehighton.  Quiet neighborhood with low lot rent of $590 per month. Home features 4 large bedrooms and 2 & 1/2 bathrooms, laundry room, dining room and large living room.  Master bedroom has two large walk in closets.  New breaker box and outlets, newer metal roof, new paint and flooring in most of the rooms.  Washer/dryer, oven and refrigerator included.  Home will be unfurnished. Empty lo",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 142000,
    "source": "apify-zillow"
  },
  {
    "id": "IrnQY9aBR05KAzbghymy",
    "address": "302 W Avenue E St, Heavener, OK 74937",
    "description": "What a deal! This spacious home offers an incredible amount of living area and charm for the price. The main level features an open, easy-flow layout connecting the living room, dining room, kitchen, and family room together totaling nearly 900 sq. ft. of connected gathering space. Beautiful wood floors add warmth throughout.\nAlso on the main floor are two bedrooms, a 9.5 x 13 bonus room, and a large utility room that doubles as a pantry with generous built-in cupboard storage. The enclosed fron",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 89000,
    "source": "apify-zillow"
  },
  {
    "id": "Ixsf2YTU4YgeSsB6mvPq",
    "address": "960 Edwards Lake Rd, Birmingham, AL 35235",
    "description": "*No seller financing.* Charming one-level home featuring 3 bedrooms and 2 full baths. Enjoy beautiful hardwood floors throughout and a modern kitchen with granite countertops. The interior has been freshly painted, offering a bright and welcoming feel. The spacious fenced yard provides plenty of room for outdoor activities and privacy. Perfect for comfortable living in a convenient location!",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 140000,
    "source": "apify-zillow"
  },
  {
    "id": "J7lOBc39x7EfhWb5p2XF",
    "address": "10207 NORMANDY COVE Street, Jacksonville, FL 32221",
    "description": "JUST LISTED in Weston Ranch!  FIXER UPPER - Selling AS-IS.  Investor Special.  NO SELLER FINANCING, NO ASSUMABLE CONTRACTS, NO WHOLE-SELLERS, CASH ONLY.  Needs roof, hvac, water heater, cabinets, countertops, appliances and minor repairs throughout. Home is priced accordingly, no repairs by Seller. ROOF=2007, HVAC=2007, HVAC= 2018.  CALL YOUR AGENT TODAY!",
    "negativeKeywords": [
      "no seller financing",
      "cash only"
    ],
    "price": 219900,
    "source": "apify-zillow"
  },
  {
    "id": "Jj2rYBDF580AqcaJy80f",
    "address": "3203 Aden St, Memphis, TN 38127",
    "description": "SPACIOUS 3/2 brick home loaded with potential! Large living room and dining room, separate living area next to kitchen, 3 spacious bedroom and large fenced-in backyard! Needs minor TLC. Would make an excellent starter home for a family or a great addition to your investment property portfolio! Motivated seller is ready to make a deal. No owner financing, wholesale, or creative offers.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 129900,
    "source": "apify-zillow"
  },
  {
    "id": "KGz5pRoKSqK5deXhrHhy",
    "address": "9905 Balfour Rd, Detroit, MI 48224",
    "description": "OPORTUNITY!!! NEW on the market this gem is in a perfect location. This nice brick colonial is located in a great area near to main streets, schools, big and important stores, and shopping centers. This is an excellent property for first-time buyers, or anyone who would like to take the opportunity to get this house and make it their home. You will find a nice size living room, dining room, a gorgeous, remodeled kitchen, an extra room in the back, 3 bedrooms, 1 full bath on the 2nd floor, and 1/",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 165000,
    "source": "apify-zillow"
  },
  {
    "id": "KLlrzEqd8OK4yK8HNyDo",
    "address": "823 Bitter Creek Cv, Memphis, TN 38127",
    "description": "Investors only! This property could be a great addition to your investment portfolio. Property is professionally managed. No sign. No wholesalers, no assignments, no creative financing, no owner financing, no blind offers! Cash or conventional offers only! DO NOT APPROACH OR DISTURB TENANTS, NO SHOWINGS WITHOUT AN ACCEPTED OFFER.   Owner/Agent",
    "negativeKeywords": [
      "no owner financing",
      "no creative financing",
      "cash or conventional"
    ],
    "price": 144900,
    "source": "apify-zillow"
  },
  {
    "id": "KPes8iJlletwgBnCuUkq",
    "address": "178 Springfield Blvd, Macon, GA 31210",
    "description": "Charming brick & vinyl two story home on corner lot with gorgeous primary suite including tray ceilings, large walk-in closet, soaking tub, separate walk-in shower and double vanity, open concept and cathedral ceiling living-dining with fireplace and access to spacious back grilling deck, laundry room, and kitchen with breakfast nook on the main level. Upstairs features a catwalk connecting 3 additional spacious bedrooms and a 2nd full bathroom with shower-tub combo. This home is fabulous for a ",
    "negativeKeywords": [
      "no seller financing",
      "cash or conventional"
    ],
    "price": 239000,
    "source": "apify-zillow"
  },
  {
    "id": "L9bFOvkmObrhnkIWIRJP",
    "address": "3204 Millwood Rd, Memphis, TN 38109",
    "description": "INVESTORS ONLY! Tenant occupied property being sold as-is.  This home has 2 bedrooms and 1 bathroom and is currently being rented at $900 per month. This home could be a great addition to your investment portfolio.  Many homes in this area are being rehabbed and sold for more money.  Excellent BRRRR opportunity.  Long term tenant who wants to stay. No sign in the yard, please do not disturb or approach the tenants.  Please make all offers contingent on interior inspection.  Cash offers only! No ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 64500,
    "source": "apify-zillow"
  },
  {
    "id": "LFaJhrfTHzubJb5yryzY",
    "address": "182 SW Mikes Gln, Lake City, FL 32024",
    "description": "4 ACRES, MULTIPLE STRUCTURES, ENDLESS POTENTIAL, & probably tetanus shots! If you're looking for turnkey perfection, keep scrolling. However, if you see potential where others see projects—and your love language is “as-is” real estate—then this is your next adventure. A 1994 3 bed / 2 bath mobile home with a corner of the roof doing its own thing, an in-ground pool, perfect for cannonballs… after a little chlorine. An original structure on-site in questionable condition. An oversized shed, ideal",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 175000,
    "source": "apify-zillow"
  },
  {
    "id": "LIKcVH1IHcElSmMgd2r6",
    "address": "21072 W State Highway 52, Kinston, AL 36453",
    "description": "The newly remodeled home is 820sf 2br. 1.5ba. master bedroom is 15'4\"x11' large master bath with large closets. The 2nd br is 11'4\"x8'10\", the large\nlaundry room has a 1/2 bath. All new paint flooring and appliances, new well pump and eq. new 200amp electric service. There are multiple buildings for\npossible business on hwy 52.\nThere is a 48'x30' hi-bay barn with 15'x8'6\" lockable storage and 14'x8'6\" drive in storage for mower or tractor. There is also a chicken coop/ canni g building with hot ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 125000,
    "source": "apify-zillow"
  },
  {
    "id": "LlGlnxKubT1ux8OMaM2s",
    "address": "3726 Stanton Ave, North Bend, OR 97459",
    "description": "FIRE SALE!! Home was a three bedroom 2 bath home located on a corner lot on a dead end street. Home caught fire and is currently not habitable.  Access viewed before making an offer and buyer signing a \"hold harmless agreement\" sent to listing agent. CASH ONLY, no Owner Carry. Seller related to listing agent.",
    "negativeKeywords": [
      "no owner carry",
      "cash only"
    ],
    "price": 125000,
    "source": "apify-zillow"
  },
  {
    "id": "MJ8LjWr5TYnAdEdTbHwO",
    "address": "602 Nara Visa Ln, Fritch, TX 79036",
    "description": "Great home close to the high school and junior high that sits on two lots. Home is 1400 sq feet with 3 bedrooms, 1 and 3/4 baths, with a large laundry room. Spacious kitchen with lots of storage. Outside is a large backyard with 2 buildings. Both outside building have electricity, one with plumbing and electricity. Selling \"as is\". No owner financing or renting.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 115000,
    "source": "apify-zillow"
  },
  {
    "id": "MlRcPX3swkN5ju0yQMcD",
    "address": "15826 Sorrento St, Detroit, MI 48227",
    "description": "BACK TO THE MARKET!!!  Beautiful colonial house located in a great area. It is a great opportunity for first time buyer to convert this  house in their home. This great brick colonial shows excellent  layout and great taste. New remodeled kitchen with tile floors. Also 3 Bedrooms, 1 bathroom upstairs, basement, and front and back yard with driveway. The house is worth seeing. Please contact the listing agent for showings.\nNO SELLER FINANCING OFFERED.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 110000,
    "source": "apify-zillow"
  },
  {
    "id": "MqPMB4MxAPrhT3bzzO5v",
    "address": "628 S Diamond St, Ravenna, OH 44266",
    "description": "Welcome to 628 Diamond St in Ravenna! This spacious 6-room, 2-bath home offers great potential with a newer water heater and furnace and no known issues with the roof or plumbing. Just needs cosmetic updates to make it shine! Conveniently located 10 minutes from Kent State University, perfect for investors seeking rental opportunities for college students. Close to Ravenna schools, Giant Eagle, Walmart, and local shops, with easy access to SR 59, 44, 14, and 88, and only 15 miles from Akron. Bei",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 235000,
    "source": "apify-zillow"
  },
  {
    "id": "NOQoyLAYAGSN8vkVSpBd",
    "address": "20 Whippoorwill Ln, Lock Haven, PA 17745",
    "description": "($152k Value) 3bd/1ba Home on 1 Acre of Land with Pool, Shed, Garage & Private Off-Street Parking PLEASE DO NOT TRESPASS ON THE PROPERTY. No wholesalers or assignment of contracts please. Only asking $39,999 giving you up to $120,000 in potential cash equity in your pocket. Background: Located in the city of Lock Haven PA, this fixer upper home is surrounded by friendly locals and located 3hrs away from Philadelphia PA, 3.5hrs from New York, NY, 3hrs from the Philadelphia International Airport (",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 39999,
    "source": "apify-zillow"
  },
  {
    "id": "NRTW24C2DG3OSA1v4pid",
    "address": "19977 Cushing St, Detroit, MI 48205",
    "description": "OPORTUNITY!!! Back on the market this gem in a perfect location. This nice brick bungalow is located in a great area near to main streets, schools, big and important stores, and shopping centers. This is an \n excellent property for investors, fix up buyers or anyone who would like to take the opportunity to get this house. You will find a nice size living, dinning, 2 bedrooms 1st floor, 1 nice big master bedroom  upstairs, 1 full bath and 1/2 in the basement, driveway and garage detached. Furnac",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 69900,
    "source": "apify-zillow"
  },
  {
    "id": "NYhtaApPO7YqCGUwOZ6i",
    "address": "4975 Springbrook Dr, Douglasville, GA 30135",
    "description": "Welcome to 4975 Springbrook Drive! This three bedroom, two full bathroom brick ranch is ready for an owner occupant or investor! The carport has been finished bringing the total square footage to 1404 (this is not a guarantee...please verify on your own)! This home will need updates but is priced to sell! Our roof is less than ten years old and our windows are double pane! Come view now before this one is gone!    -LEAVE SELLER INFO BLANK ON OFFERS (WE WILL COMPLETE THIS INFO OURSELVES) -LISTING",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 155000,
    "source": "apify-zillow"
  },
  {
    "id": "NoCPomxsOx1Z12XTJAIS",
    "address": "403 Brooks Ave, Raleigh, NC 27607",
    "description": "Great location for NCSU students!   2010 new windows.  2016 home received new roof and new gas water heater.  Kitchen new cabinets, granite countertops and appliances.  No owner financing available.  Home has many nice features, here are a few:  Fireplace with gas logs in LR.  Hardwood floors throughout and beautiful tile in kitchen and bath.  Separate DR.  Ceiling fan in back bedroom.  Room down hallway on right is a flex room. Currently  a laundry, cabinet room. Could become an office/laundry ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 565000,
    "source": "apify-zillow"
  },
  {
    "id": "OEQhIQlWzXrCv5PL7FPf",
    "address": "178 Springfield Blvd, Macon, GA 31210",
    "description": "Charming brick & vinyl two story home on corner lot with gorgeous primary suite including tray ceilings, large walk-in closet, soaking tub, separate walk-in shower and double vanity, open concept and cathedral ceiling living-dining with fireplace and access to spacious back grilling deck, laundry room, and kitchen with breakfast nook on the main level. Upstairs features a catwalk connecting 3 additional spacious bedrooms and a 2nd full bathroom with shower-tub combo. This home is fabulous for a ",
    "negativeKeywords": [
      "no seller financing",
      "cash or conventional"
    ],
    "price": 239000,
    "source": "apify-zillow"
  },
  {
    "id": "OGAlrk0Gxb9hcA1CC15E",
    "address": "5700 N 14 1/2 St, McAllen, TX 78504",
    "description": "Complete Renovation of this Beautiful 3 Bedrooms 2 Bath 2 Car Garage Brick Home in the Heart of McAllen! All new modern features including wood tile flooring throughout for easy cleaning and maintenance. White, elegant quartz countertops , in kitchen and bath with modern cabinets for your storage and easy cleaning. All new ceilings and modern fixtures throughout for the present-day look and feel, all double pane windows, horizontal doors, freshly painted with neutral colors to accommodate your f",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 229000,
    "source": "apify-zillow"
  },
  {
    "id": "Oraqe6QMbkdcYCazRAgV",
    "address": "1318 Coconut Palm Ave, San Juan, TX 78589",
    "description": "corner lot, chain link fence, citrus trees, sold as is, CASH Only, possible owner finance",
    "negativeKeywords": [
      "cash only"
    ],
    "price": 85000,
    "source": "apify-zillow"
  },
  {
    "id": "PJciNbIS9lqZXNWQfxCY",
    "address": "1230 E Davis Ave, Fort Worth, TX 76104",
    "description": "BUYER HARD MONEY LENDER FINANCING FELL THRU.  NO SELLER FINANCING.  \r\nCALLING ALL INVESTORS.  THIS IS A THREE BEDROOM 1 BATH SINGLE FAMILY HOME THAT HAS BEEN GUTTED AND NEEDS SOMEONE TO MAKE IT BEAUTIFUL AGAIN.  CASH OR HARD MONEY OK.  NO SELLER FINANCING.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 120000,
    "source": "apify-zillow"
  },
  {
    "id": "Qh3af4Kx0W8QsL6O2uFh",
    "address": "3100 Princeton Dr, Dayton, OH 45406",
    "description": "Located in the Cornell Heights Neighborhood\nWelcome to this classic 2-story home nestled in the heart of the Cornell Heights neighborhood. This old-style charmer offers spacious rooms and 1,448 square feet of living space, sitting proudly on a corner lot with plenty of potential.\nInside, you'll find large living areas with endless possibilities for restoring and personalizing. The home will need updating throughout, making it the perfect opportunity for investors, flippers, or anyone looking to ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 79000,
    "source": "apify-zillow"
  },
  {
    "id": "RPmNFqNxLMHs2mFhofyJ",
    "address": "6280 Elmore Rd, Memphis, TN 38134",
    "description": "Great Bartlett location on almost an acre of property! Ideal for a fix and flip, rental or clear the land and build your dream home! This 3 bed, 1 1/2 bath, all brick home has been loved and cared for since 1955. Cash only offers, no wholesalers or assignments, no owner financing. Will not go FHA or VA financing.",
    "negativeKeywords": [
      "no owner financing",
      "cash only"
    ],
    "price": 250000,
    "source": "apify-zillow"
  },
  {
    "id": "RgWsxBM559EyxNHVd1qO",
    "address": "5953 110TH Street, Jacksonville, FL 32244",
    "description": "FOR INVESTORS ONLY AS THE HOUSE IS TENANT OCCUPIED UNTIL MAY 2026.\r\n\r\nTHE HOUSE IS BEING RENTED FOR $1,250 PER MONTH & NEW OWNERS MUST HONOR THE TENANT'S LEASE AGREEMENT.\r\n\r\nSOLID CONCRETE BLOCK STRUCTURE WITH 756 SQ T OF LIVING SPACE WITH 2 BEDROOMS, 1 BATHROOM, A 1 CAR GARAGE WITH A LARGE BACKYARD.\r\n\r\nTHE HOUSE IS IN GOOD CONDITION AND THE PICTURES ARE FROM BEFORE THE CURRENT TENATNS MOVED IN.\r\n\r\n\r\nTHE SHINGLE ROOF WAS REPLACED IN 2018 & THE AC SYSTEM WAS  REPLACED IN 2019 WITH A NEW WATER HEA",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 180000,
    "source": "apify-zillow"
  },
  {
    "id": "RqFvzDOBAiEiPLqmh3z3",
    "address": "3287 Boxdale St, Memphis, TN 38118",
    "description": "INVESTORS ONLY! Tenant occupied property being sold as-is, this property could be a great addition to your rental portfolio.  This home has 3 bedrooms and 2 bathrooms and is currently being marketed to investors. Professionally managed by Mid South Best Rentals. Rent is $1150/mo. Deposit was $950. Many homes in this area are being rehabbed and sold for more money.  Excellent BRRRR opportunity. No sign in the yard, please do not disturb or approach the tenants.  No wholesalers, no assignments, no",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 130000,
    "source": "apify-zillow"
  },
  {
    "id": "RyVP9b5ny8UpkqK4BRlu",
    "address": "616 Brooks Ave, Raleigh, NC 27607",
    "description": "This is a remodel or tear down and rebuild.   Greenhouse in backyard.   Remodelers please not unfinished basement space, carport and front porch.  No seller financing available.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 675000,
    "source": "apify-zillow"
  },
  {
    "id": "SOfmGtDXyvulhkbXqPy4",
    "address": "6539 Wimble Rd, Memphis, TN 38134",
    "description": "INVESTORS ONLY! Tenant occupied property being marketed to investors. This can be a great addition to your rental portfolio. Property is Professionally managed by Mid South Home Rentals. Currently rented at $1,350/mo. This home was renovated in early 2025. ONLINE VIDEO AVAILABLE UPON REQUEST. No sign. PLEASE DO NOT APPROACH OR DISTURB TENANT. Make all offers contingent on an interior inspection. No wholesalers, no assignments, seller is not interested in owner financing or subject-to offers. CAS",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 126900,
    "source": "apify-zillow"
  },
  {
    "id": "SPHAsZtCIcY7tcbiyDmN",
    "address": "6455 County Road 1410, Bogata, TX 75417",
    "description": "1 bed 1 bath house on 1/2 acre of land in Bogata Texas. The address is 6455 County Road 1410, Bogata, Texas. No owner financing, and not looking to rent.\nAsking $94,900\n-New siding\n-New roof\n-New paint\n-New flooring\n-New Cabinets\n-1.3 miles from Rivercrest ISD\n-Paved County Road\nBasically renovated from top to bottom.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 94900,
    "source": "apify-zillow"
  },
  {
    "id": "SaD3Y0e1iIeXm9zUzMM3",
    "address": "3830 Roberts St, Kansas City, MO 64124",
    "description": "SOLD AS-IS CASH OR HARD MONEY ONLY. No seller financing. Enter at your own risk. Property was previously a rental and has not been trashed out. Here's a great opportunity for investors and flippers. Showings by appointment only.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 80000,
    "source": "apify-zillow"
  },
  {
    "id": "Sq4v8S6s53kB0suiRXCE",
    "address": "8 Amy Way, Milo, ME 04463",
    "description": "Just finished building this 24x28 post n beam cabin .\r\nare you looking for a private hide away with no neighbors, no barking dogs, no cars driving by ?\r\nWell this cabin is for you\r\nsits on a very private 3 acre lot with a large yard plenty of room for a large garage has  a little spring fed pond .(the wildlife loves) yet is still close to town.\r\n6x24 porch and a 6x34 slate patio . log siding steel roof . Built on a concrete slab .large open concept living room .Cathedral ceilings, knotty Pine an",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 249000,
    "source": "apify-zillow"
  },
  {
    "id": "StusgR8nn2hs2HJ8QWCi",
    "address": "173 Kentucky Ave, Clarksville, TN 37042",
    "description": "\nNo realtor fees! \n\nFor sale only – no owner financing available.\n\nAs is. All major issues are fixed. Just cosmetic things. \n\nLocation: 173 kentucky ave Clarksville, TN\n 3 Bedroom |  1 Bathroom | ~ 915 \n\n\nFeatures & Highlights:\n•New roof with a 40 year warranty.  \n• Plumbing from the house to the road recently replaced. \n• Fruit trees and a garden plot already set up for next spring. \n• Well insulated. Highest electric bills has been $150.\n• Good neighbors.  Quiet neighborhood.  \n\n\n For faster r",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 187000,
    "source": "apify-zillow"
  },
  {
    "id": "SutQa2iAGnR0xbxsLyKY",
    "address": "4309 Blair Ave, Saint Louis, MO 63107",
    "description": "Investor opportunity! This single-family home is currently tenant-occupied, offering immediate rental income and a seamless addition to your portfolio. The property features a traditional layout with comfortable living spaces and is situated in a convenient location close to schools, parks, and major highways.\n\nCan be sold as a package with 4306 Strodtman, 4417 Strodtman, 4337 Strodtman, 1923 Newhouse, 4410 N 19th, 4512 N 19th and 4315 N 9th\n4bd/1.5ba. Rent is is $1,400\nNo seller financing",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 130000,
    "source": "apify-zillow"
  },
  {
    "id": "Szv6f107af1nQZu4AR4l",
    "address": "755 Whitney Ave, Memphis, TN 38127",
    "description": "Great investment opportunity!! Property is tenant occupied and income producing, $720 monthly. No showings without accepted offer. No wholesalers, no seller financing available. Do not disturb tenant! Fantastic addition to your portfolio!",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 55000,
    "source": "apify-zillow"
  },
  {
    "id": "T9kk0Vi84gi1D7jFhBtb",
    "address": "3957 Strandhill Rd, Cleveland, OH 44128",
    "description": "Value Add Property! Bring this 3 bedroom, 1.5 bath Colonial back to its original glory with some TLC! Great Location! Minutes from Shaker Heights! Nice layout! Main level has space for living room area with lots of natural light/windows, dining room area with two corner curio cabinets built in, Kitchen, half bath and storage! Plus bonus room to back of the home that can be an additional 4th Bedroom! Second level offers 3 nice sized bedrooms, closet spaces and a Full bathroom! Nice sized basement",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 75000,
    "source": "apify-zillow"
  },
  {
    "id": "THgn0o57oRtANspIPUsX",
    "address": "8716 Independence Ave, Kansas City, MO 64125",
    "description": "SOLD AS-IS CASH OR HARD MONEY ONLY. No seller financing. Enter at your own risk. Property was previously a rental and has not been trashed out. Here's a great opportunity for investors and flippers. Showings by appointment only.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 65000,
    "source": "apify-zillow"
  },
  {
    "id": "TYBTvNNAjzGxmBMoFk1C",
    "address": "7202 Mill House Dr N, Mobile, AL 36619",
    "description": "Use your imagination and some updating to make this your home that you have been looking for right off Sollie Rd! Mill House is a quite street that is a circle in and out. This area has so many good eateries and shopping places to offer. 3 beds, 2 baths, 1260 sq ft ready to make your own.  Gold Fortified roof that is only 7 years old, dishwasher 2024, HVAC 2019, water heater 2021, granite countertops, 24x60 heavy duty detached carport that can withstand up to 140 miles worth of wind.  Back yard ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 199000,
    "source": "apify-zillow"
  },
  {
    "id": "TvTLGkyYXtbdv6Vw4L9G",
    "address": "1668 Oakland Rd, Forest City, NC 28043",
    "description": "Investor or Handyman Special! This 1920s home in the Oakland community of Rutherford County is ready for a new owner to bring their vision and create a home that reflects their style.\nSituated on .36 acre lot, this 1 bedroom property offers great potential for renovation or investment. Metal roof, natural gas wall furnace, no A/C. Conveniently located near the Hwy 74 Bypass and Hwy 221 - nearby local shops, restaurants and historic downtown Forest City are just a short drive away.\nEnjoy nearby a",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 74900,
    "source": "apify-zillow"
  },
  {
    "id": "UpzZrFnHIIZ7jZ9pUgST",
    "address": "1401 W Tilden St, Roswell, NM 88203",
    "description": "Priced right at $189,900, this home on a large corner lot has 3 bedrooms, 1.5 bath. The house has been completely remodeled and finished in August 2025.  It includes a new refrigerator and new electric stove. The kitchen has new cabinets and counter top. The laundry room, with some pantry features is adjacent to the New kitchen. Other features include new light features, doors, windows & vanities. new plumbing, new electrical, new insulation, new windows & blinds, new continuous flooring, new ap",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 189900,
    "source": "apify-zillow"
  },
  {
    "id": "WsJrhjyfACMdfLsToaOW",
    "address": "2359 Waverly, San Antonio, TX 78228",
    "description": "INVESTOR'S special - Great investment opportunity with Owner Financing Terms!!!!!!!!. This home will make a great rental or Starter Home opportunity needing some TLC. Cash only or Take advantage of our Owner Finance Terms...... Home is being sold as is. Location !!! Location !!!! Location!!!!!!!!!!! Home Is Located In One Of The Best Active Development Of The West Side. This 2 Bedrooms 1 Bath Home Has Potential For Additional Living Square Feet & has a huge yard. For Those Who Love City Life , H",
    "negativeKeywords": [
      "cash only"
    ],
    "price": 89900,
    "source": "apify-zillow"
  },
  {
    "id": "WzEKlzs60tCeyCBfYTB9",
    "address": "4212 Parkchester Ave, Memphis, TN 38118",
    "description": "INVESTORS ONLY! Tenant occupied property that could be a great addition to your rental portfolio.  This home has 3 bedrooms and 1-1/2 bathroom and is currently being rented at $1150 per month. It also has covered parking and is located on a quiet street.  Professionally managed by Realty Capital Management.  Many homes in this area are being rehabbed and sold for more money.  No sign in the yard, please do not disturb or approach the tenants.  No wholesalers, no assignments, no owner financing o",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 120000,
    "source": "apify-zillow"
  },
  {
    "id": "Y4Oj76YUstLX1d5BbaZN",
    "address": "302 Arcadia Rd, Cherry Tree, PA 15724",
    "description": "Address: 302 Arcadia Rd, Cherry Tree, PA 15724 \n\n($90k Value) 5bd/2ba Fixer Upper Home with Garage & Private Off-Street Parking\n\nPLEASE DO NOT TRESPASS ON THE PROPERTY. CONTACT US FIRST FOR PERMISSION.\n\nOnly asking $9,999 giving you up to $80,000+ in potential cash equity in your pocket.\n\nText only (no calls): TBA\n\n\nBackground:\n\nLocated in the borough of Cherry Tree PA, this fixer upper home is surrounded by friendly locals and located 1.5hrs away from Pittsburgh PA, 2hrs from the Pittsburgh Int",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 9999,
    "source": "apify-zillow"
  },
  {
    "id": "YibqIZKI2o76oACbtfMz",
    "address": "642 Lagrange Park Cv, Memphis, TN 38111",
    "description": "INVESTORS ONLY! Tenant occupied property being marketed to investors. This can be a great addition to your rental portfolio. Property is Professionally managed by Mid South Home Rentals. Currently rented at $795/mo. ONLINE VIDEO AVAILABLE UPON REQUEST. No sign. PLEASE DO NOT APPROACH OR DISTURB TENANT. Make all offers contingent on an interior inspection. No wholesalers, no assignments, seller is not interested in owner financing or subject-to offers. CASH OR CONVENTIONAL OFFERS ONLY. Seller is ",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 68000,
    "source": "apify-zillow"
  },
  {
    "id": "ZgGZ6BzMC42Q07UbcQCj",
    "address": "4065 Mesa Dr, Clearlake, CA 95422",
    "description": "LAKEFRONT fixer home! Own a beautiful piece of lake frontage with existing pier/dock. 1071sqft cabin 2bed/1bath. Property is on public water & sewer. Needs work, but could be brought back to the little fishing getaway it once was! Great lake front yard with private beach. Quiet part of the Lake with deeper water. Only about 10 mins into town. No seller financing at this time.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 225000,
    "source": "apify-zillow"
  },
  {
    "id": "a6FVbsiaobNoceTO6Ivj",
    "address": "2916 N Merrimac Ave, Chicago, IL 60634",
    "description": "Stepping back in history, this Chicago Brick Bungalow is waiting for your attention. Home needs work. Built in 1929 when things were built substantially. 3 -5 beds, 2 baths and basement with 2 car garage. Day Care close and newly renovated Steinmetz College Prep Academy. Sold AS IS, no repairs will be done. No owner financing.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 289000,
    "source": "apify-zillow"
  },
  {
    "id": "aRzxniEf23xSccxZFoOQ",
    "address": "7814 Jewella Ave, Shreveport, LA 71108",
    "description": "This awesome 2 bedroom home rents for $890 per month and just got a new roof in 2024.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 3103 Shed Rd (MLS 21106161), and 116-118 Loop St (MLS 21104689). No owner financing or creative finance is offered with this package",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 52900,
    "source": "apify-zillow"
  },
  {
    "id": "aVEuNLvYBh87CdtQpXPI",
    "address": "2323 35th St S, Saint Petersburg, FL 33711",
    "description": "3 bedroom, 1 bathroom and 1 car garage home located near the Skyway Marina district, a very desirable area in St Petersburg and close to Gulfport. This property needs some renovation, but with a little creation, vision and work, it is a perfect opportunity for investors or first time home buyers looking to create significant value. This property consists of a double lot (0.24 acres - 10,498 square feet lot), great for all developers and builders looking to build two new adjacent homes. Don't mis",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 195000,
    "source": "apify-zillow"
  },
  {
    "id": "aaBohtiwgRzUNNQTQD6j",
    "address": "9607 Fuller Ave, Cleveland, OH 44104",
    "description": "Discover this beautifully updated 4-bedroom, 1-bath colonial located in the heart of Cleveland s Union-Miles Parkneighborhood. Blending original character with modern updates, this move-in ready home is perfect for homeowners or investors seeking strong rental potential.\n?? Property Highlights\nBedrooms: 4\nBathrooms: 1 Full\nLiving Space: 1,314 sq ft\nLot Size: 5,401 sq ft\nYear Built: 1900\nStyle: Colonial\nGarage: Detached 1-car garage\nPrice/Sq Ft: $72\n?? Recent Renovations\nNew architectural roof wi",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 98000,
    "source": "apify-zillow"
  },
  {
    "id": "aaYAzWH84GiTzEX3GgY4",
    "address": "9314 Harvard Rd, Detroit, MI 48224",
    "description": "WELCOME HOME This 3 bedroom, 1.5 bathroom brick bungalow has been recently renovated and is ready for YOU to call it home! The property features an updated kitchen w/ new cabinets, vinyl plank flooring, and some butcher block counter-tops, refinished hardwood floors throughout most of the 1st floor, new lighting and fresh paint throughout, an updated vanity and light fixture in the full bathroom, a refinished half bathroom in the basement, and new carpet in the spacious upstairs bedroom! Other n",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 109900,
    "source": "apify-zillow"
  },
  {
    "id": "amKC2s6KBElcnJ9Q4E9r",
    "address": "15074 Mayfield St, Detroit, MI 48205",
    "description": "**OPPORTUNITY** This 4 bedroom, 1 bathroom oversized brick bungalow would be perfect for an investor looking to grow their portfolio! There is a tenant whose rent is paid 100% through Traveler's Aid @ $1,150/month and is there on month-to-month terms. The property features an updated kitchen w/ granite counter-tops, hardwood flooring throughout most of the 1st floor, spacious living and dining rooms, 2 bedrooms on each floor including the primary on the 2nd floor with unique wood beam decor, a l",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 69900,
    "source": "apify-zillow"
  },
  {
    "id": "cjYTg8lpBbnV9A4YG25K",
    "address": "1876 Coventry Dr, Memphis, TN 38127",
    "description": "GREAT INVESTMENT OPPORTUNITY!  This 3 bedroom, 2 bathroom brick home is rented for $1,150/month to a stable, long-term tenant with a lease that is good until 6/30/2026.  Professionally managed.  Home was totally refurbished in 2024 including- brand new roof, HVAC, water heater and cosmetic upgrades.  Tenant ledger and maintenance report available upon request.  Convenient location near many amenities will keep this home in consistent demand for tenants and homeowners alike!  No seller financing,",
    "negativeKeywords": [
      "no seller financing",
      "cash or conventional"
    ],
    "price": 136000,
    "source": "apify-zillow"
  },
  {
    "id": "dq0Im4CjnaXU5UZjJ3my",
    "address": "1907 Parker Dr, Ozark, AL 36360",
    "description": "1907 Parker Dr. For Sale by owner. 3 bedrooms, laundry room, 1 bath fenced in yard front and back and 1300 sq ft. Has in ground pool that needs a new liner. Also needs a new air condenser. Selling it as is. Here are some photos. $85k. House needs some repairs but over all a nice home.NO RENT TO OWN and ABSOLUTELY NO OWNER FINANCING!!",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 79900,
    "source": "apify-zillow"
  },
  {
    "id": "dwH5RyRoWLDFddOW2Sdz",
    "address": "131 S Detroit Ave, Toledo, OH 43609",
    "description": "Great investment opportunity! This well-maintained home at 131 South Detroit Avenue offers reliable rental income with a tenant currently paying $950 per month. The lease is in place through August 2026, providing immediate cash flow for an investor. The primary bedroom features a beautiful bay window, adding plenty of natural light and charm. Recent updates include a 3-year-old roof and all new windows throughout. Conveniently located near local amenities, parks, and major roadways. No showings",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 99000,
    "source": "apify-zillow"
  },
  {
    "id": "dxdHtiUAC20xChrS6EHN",
    "address": "2337 Greenvale Rd, Cleveland, OH 44121",
    "description": "Solid investment opportunity in Cleveland s Euclid-Green area! This 2-bedroom, 1-bath single-family home (754 sq ft) is tenant-occupied, generating $1,182/month in rent with the tenant paying all utilities, a true set-it-and-forget-it addition to your portfolio.\nThe property is in a high-demand rental pocket with strong returns and reliable occupancy. Whether you re adding to your buy-and-hold portfolio or looking for immediate cash flow, this one checks the boxes. Local professional property ma",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 99000,
    "source": "apify-zillow"
  },
  {
    "id": "ei8CWI8pLJMu7USvVeko",
    "address": "2903 Millard St, Shreveport, LA 71108",
    "description": "This great home, located on over an acre, has new LVP and tile flooring. Central air in 2024 as well as new paint and fixtures. This one is under market rents and could be raised significantly from the $910 per month it currently brings in.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 31",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 84900,
    "source": "apify-zillow"
  },
  {
    "id": "elemFOguYgGLpWR227cS",
    "address": "4501 Woodhall St, Detroit, MI 48224",
    "description": "ARE YOU LOOKING FOR A MOVE-IN READY BRICK BUNGALOW ON A CORNER LOT IN THE CORNERSTONE VILLAGE NEIGHBORHOOD? That is it! Perfect for a first-time homebuyer or investor looking for a great opportunity of cash flow with average rents around $1,100. This 3-large-bedrooms 1-bath home sits on a large fenced corner lot. You ll notice right away all of the natural light from the moment you walk in. You ll love this mix of old & new with full updated historic Detroit charm this area is known for.\nLarge l",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 99000,
    "source": "apify-zillow"
  },
  {
    "id": "etn7HLhKv7xg4rP45Rhm",
    "address": "309 W Chelo Dr, La Feria, TX 78559",
    "description": "Investor Opportunity. Welcome to 309 W. Chelo Dr. in La Feria, TX. Built in 1977, this home has been rented out for over 10 years. It is currently occupied. Cash or conventional loan. No seller financing. It is a 3 bedroom 2 bath. Showings will be available in Nov",
    "negativeKeywords": [
      "no seller financing",
      "cash or conventional"
    ],
    "price": 110000,
    "source": "apify-zillow"
  },
  {
    "id": "ezZ9ZGopZ1WBDx8A4PPl",
    "address": "3211 Higgins Dr, Albany, GA 31721",
    "description": "YOU DON'T WANT TO MISS THIS OPPORTUNITY! ALL BRICK, STUNNING RANCH PLAN; MOVE IN READY. SELLER WILL RESPOND TO ALL QUESTIONS/INFORMATION REQUESTS 404-569-3803. NO CREATIVE FINANCING, NO SELLER FINANCING; CASH OR STANDARD LOAN PRODUCTS ACCEPTABLE. 100% LOAN PRODUCTS, 1% CONVENTIONAL, DOWN PAYMENT ASSISTANCE ELIGIBLE.",
    "negativeKeywords": [
      "no seller financing",
      "no creative financing"
    ],
    "price": 240000,
    "source": "apify-zillow"
  },
  {
    "id": "f7avXOGXqcPBBHC1Qrzx",
    "address": "958 Birch St, Memphis, TN 38108",
    "description": "ATTENTION INVESTORS!  This spacious 3 bedroom 2 bathroom house will make an excellent addition to your portfolio!  Completely refurbished and rented for $1,150/month and under professional management.  Home features spacious den with fireplace, separate dining room, large master bedroom with convenient exterior access, large upstairs storage area, and much more!  Conveniently located 1 mile from Rhodes College and 2 miles from Overton Park, the Memphis Zoo, and Midtown Memphis.  Cash or conventi",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 129000,
    "source": "apify-zillow"
  },
  {
    "id": "fXihKE00XjUA6awzZAen",
    "address": "10897 Lakepointe St, Detroit, MI 48224",
    "description": "MOVE IN READY AND GREAT PRICE. THIS IS IT!! THIS BRICK BUNGALOW IS A GREAT OPORTUNITY FOR A FIRST TIME  BUYER TO MAKE THIS HOUSE THEIR HOME OR FOR AN INVESTOR LOOKING FOR CASH FLOW PROPERTY.  YOU WILL FIND 1  BEDROOM UPSTAIRS WITH PLENTY ROOM AS YOUR MASTER, 2 BEDROOMS ON THE FIRST LEVEL, CLOSETS ON HALLWAYS, AND A NICE BIG LIVINGROOM, ALSO A NICE SIZE BASEMENT. PROPERTY HAS FENCE ALL AROUND THE BACK YARD.  GREAT  LOCATION, NEAR TO I94, GROSSEPOINTE, SHOPPINGS, SCHOOLS...\nNO SELLER FINANCING.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 90000,
    "source": "apify-zillow"
  },
  {
    "id": "fYubGDvj9FM9KW1oeSwu",
    "address": "107 Southside Dr, Griffin, GA 30224",
    "description": "Welcome to this delightful four-sided brick ranch that perfectly blends nostalgia and comfort! Nestled in a serene neighborhood in Griffin, this home features three spacious bedrooms and two full bathrooms.     While it boasts a touch of vintage charm, it’s been meticulously maintained, ensuring that it’s move-in ready. The home includes a two-car carport and a large, mostly flat backyard—ideal for outdoor gatherings or gardening. Plus, you'll love the large wooden deck overlooking the backyard,",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 225000,
    "source": "apify-zillow"
  },
  {
    "id": "frapg9yFkcvrws61PGOb",
    "address": "17552 Ferguson St, Detroit, MI 48235",
    "description": "**OPPORTUNITY** Investors, this NW Detroit 3 bedroom, 1 bathroom vinyl-sided bungalow needs some TLC and it would be a perfect Section 8 rental to add to your portfolio! With Sec 8 rents as high as $1,350/month for similar properties, your ROI would be sky-high! The property features forced air heating, an updated kitchen and bathroom that require just a few touch-ups, PEX plumbing, a 100 amp electrical panel, and so much more! CASH OR HARD MONEY ONLY, NO SELLER FINANCING.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 59900,
    "source": "apify-zillow"
  },
  {
    "id": "gCmaTIdpg8CRLC67dpL7",
    "address": "630 Pennsylvania Ave, Etowah, TN 37331",
    "description": "This brick ranch style home is a 5-bedroom 2 bath home located in Etowah Tennessee. It has a master suite and 4 bedrooms great for children or extra office space. The kitchen has a lot of cabinet space in it for all your storage needs. The basement is unfinished but with some TLC it would make a great space for a home gym or extra storage space. This home also has a bonus room located in the back of the home that is great for family gatherings. There is a large outdoor patio great for grilling a",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 189900,
    "source": "apify-zillow"
  },
  {
    "id": "gE6qGBoFvDMvOlDknx9k",
    "address": "2034 Driftwood Ave, Memphis, TN 38127",
    "description": "INVESTERS ONLY. Tenant occupied property being marketed to investors. This can be a great addition to your rental portfolio. Property is Professionally managed by Reedy and Company. This 2 bed 1bath home is rented at $925/mo. Many homes in this area are being rehabbed and sold for more money. No sign. PLEASE DO NOT APPROACH OR DISTURB TENANT. Make all offers contingent on an interior inspection. No wholesalers, no assignments, seller is not interested in owner financing or subject-to offers. CAS",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 90000,
    "source": "apify-zillow"
  },
  {
    "id": "gY0ciqeAbFTw9rml1b3L",
    "address": "14303 Rosemary St, Detroit, MI 48213",
    "description": "OPORTUNITY!!!Back on the market this gem in a perfect location. This nice brick bungalow/colonial is located in a great area near to main streets, schools, stores, and shopping centers. This is an excellent  property for investors, fix up buyers, 1st time buyers or anyone who would like to take the opportunity  to get this house. You will find a nice size living, dinning, 1bedroom 1st floor, 2 nice bedrooms  upstairs, 1 full bath and 1/2 in the basement, big driveway.\nProperty is sold ASIS. No s",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 68900,
    "source": "apify-zillow"
  },
  {
    "id": "gr4dhGokWqMNO6Asz8ve",
    "address": "3100 Princeton Dr, Dayton, OH 45406",
    "description": "Located in the Cornell Heights Neighborhood\nWelcome to this classic 2-story home nestled in the heart of the Cornell Heights neighborhood. This old-style charmer offers spacious rooms and 1,448 square feet of living space, sitting proudly on a corner lot with plenty of potential.\nInside, you'll find large living areas with endless possibilities for restoring and personalizing. The home will need updating throughout, making it the perfect opportunity for investors, flippers, or anyone looking to ",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 79000,
    "source": "apify-zillow"
  },
  {
    "id": "hZmHaQq4dCVT40HEvy8L",
    "address": "1035 Rodey Ave, Charlotte, NC 28206",
    "description": "Attention Builders, Developers, and Investors! Don’t miss this incredible opportunity in the rapidly growing Druid Hills community of Charlotte! This 3-bedroom, 1.5-bath home sits on a spacious, deep, and flat lot—approximately 0.43 acres, offering the perfect canvas for your next project. Whether you’re planning a new build, renovation, or redevelopment, this property’s potential is endless. Located just minutes from Camp North End, NoDa, Uptown, and Plaza Midwood, you’ll enjoy easy access to s",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 295000,
    "source": "apify-zillow"
  },
  {
    "id": "i2sotYi1W5cbW5Pvo5lV",
    "address": "3333 Madi Tanner Rd, Blackshear, GA 31516",
    "description": "    Peaceful, country living, but just minutes from town!!\n 3 bedrooms\n 2 bathrooms\n 1.5 Acres\n 2 car garage\n  3-bedroom 2 bath home on 1.5 acres only 4 minutes to town, but in the country!! 1560 sq. ft. of living space & set on 1.5 acres of serene living on a dead-end street.  Beautifully landscaped!!\nOpen concept living, perfect for family game night!  \n Large dining room perfect for hosting!\n The spacious kitchen features beautiful oak cabinets, plenty of prep-space and new stainless-steel ap",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 312000,
    "source": "apify-zillow"
  },
  {
    "id": "ibiqE3fx1kKSNcbHZ3Ot",
    "address": "358 Fairview Ave, Long Valley, NJ 07853",
    "description": "Set on 1.19 acres, this property presents a strong opportunity for investors, contractors, or buyers seeking a full renovation project. The home requires a complete rehab and currently has no kitchen and no working plumbing, offering a clean slate for redesign or redevelopment. A detached barn adds additional potential. Recent septic updates. Seller Financing is available. Cash only",
    "negativeKeywords": [
      "cash only"
    ],
    "price": 379000,
    "source": "apify-zillow"
  },
  {
    "id": "ilMO4BGh4dn72CGAlssM",
    "address": "412 E East St, Rayne, LA 70578",
    "description": "Updated 2 bed, 1 bath home on a corner lot just 3 blocks from Rayne High.Features central A/C & heat, fenced backyard, ceiling fans throughout, and a powered 9x9 storage shed.Double carport with side street access. Quiet neighborhood, easy I-10 access, 20 mins to Lafayette.No owner financing.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 105000,
    "source": "apify-zillow"
  },
  {
    "id": "ix6uoSB2EIXisMzH8WId",
    "address": "2903 Millard St, Shreveport, LA 71108",
    "description": "This great home, located on over an acre, has new LVP and tile flooring. Central air in 2024 as well as new paint and fixtures. This one is under market rents and could be raised significantly from the $910 per month it currently brings in.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825), 31",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 84900,
    "source": "apify-zillow"
  },
  {
    "id": "jj2zOXoUCDHYPo7XiXSU",
    "address": "4682 Bullock Ln, Loganville, GA 30052",
    "description": "Welcome to this delightful three-bedroom, two-bath home built in 1992, offering 1,468 square feet of living space. This property is in excellent condition and features durable hardy plank siding.    Enjoy the convenience of a two-car garage, a flat backyard perfect for outdoor activities, and a separate tool shed for all your storage needs. Plus, you'll love the very large screened-in porch, ideal for relaxing and entertaining.    Additionally, the seller will provide a home warranty up to $1,00",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 295000,
    "source": "apify-zillow"
  },
  {
    "id": "jvs6smkDDooC1Kzt0pAU",
    "address": "3453 E 105th St, Cleveland, OH 44104",
    "description": "Wow! Look at this 5 bedroom, 1.5 bath BRICK Colonial! Stunning Home! The main level offers a large enclosed front porch area that leads into the front foyer! Living Room is spacious with beautiful hardwood floors, gas fireplace, plenty of natural light, large dining room area fit for bigger furniture, large long kitchen area with room for a dinette table and pantry area! The second level houses FIVE bedrooms with ample closet space and a Full Bathroom on the second level! Basement area is large ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 114900,
    "source": "apify-zillow"
  },
  {
    "id": "kRQzrSj0uuSiAoba0ppJ",
    "address": "1473 STATE Street W, Jacksonville, FL 32209",
    "description": "FOR INVESTORS ONLY AS THE HOUSE IS TENANT OCCUPIED UNTIL JULY 2026. \r\n\r\nTHE HOUSE IS BEING RENTED FOR $1,200 PER MONTH & NEW OWNERS MUST HONOR THE TENANT'S LEASE AGREEMENT.\r\n\r\nBEING SOLD IN ''AS IS CONDITION''\r\n \r\n1,040 SQ T OF LIVING SPACE WITH 3 BEDROOMS, 1 BATHROOM, \r\n\r\nTHE HOUSE NEEDS COSMETIC REPAIRS LIKE PAINT & FLOORING AND THE PICTURES ARE FROM BEFORE THE CURRENT TENANTS MOVED IN. \r\n\r\nTHE SHINGLE ROOF WAS REPLACED IN JULY 2018. \r\n\r\nNO WHOLESALERS AND NO SELLER FINANCING. CASH OR COVENTIO",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 140000,
    "source": "apify-zillow"
  },
  {
    "id": "kYI5xu1BoaCaYm4gSLm9",
    "address": "305 N Steer St, Addison, MI 49220",
    "description": "Right on the Mill Pond!!  Enjoy a great relaxing view with this 4 bdrm 2 bath roomy home with so many possibilities!! 2 main floor bedrooms, and an updated kitchent too! Perfect for anyone that has outgrown their current home and a great commuter location!  For Sale Only. NO Rental, NO Land Contract NO Seller financing available. Sold ‘AS IS’ by electronic bid only. FHA Case#264-359327 IE. For info visitwww.HUDHomestore.gov. All offers to be electronically uploaded by Realtor. Buyer selects Titl",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 160000,
    "source": "apify-zillow"
  },
  {
    "id": "kwtyGZTAo8ivczfE2YJi",
    "address": "5330 Whitworth Rd, Memphis, TN 38116",
    "description": "Investors only! This property could be a great addition to your investment portfolio. Property is professionally managed. No sign. No wholesalers, no assignments, no creative financing, no owner financing, no blind offers! Cash or conventional offers only! TENANTED PROPERTY: DO NOT APPROACH OR DISTURB TENANTS, NO SHOWINGS WITHOUT AN ACCEPTED OFFER. Owner/Agent",
    "negativeKeywords": [
      "no owner financing",
      "no creative financing",
      "cash or conventional"
    ],
    "price": 194900,
    "source": "apify-zillow"
  },
  {
    "id": "lD5jZBhvkQm6A0vzFF5v",
    "address": "1908 Boaz Rd, Raleigh, NC 27610",
    "description": "?? 1908 Boaz Road Raleigh, NC 27610\nFor Sale by Owner Rochester Heights Neighborhood\nOverview\nNestled on a quiet quarter-acre lot just one mile from Downtown Raleigh, this Rochester Heights home sits near the up-and-coming Raleigh Soccer Stadium District and other SE Raleigh revitalization projects.\nCurrently occupied by a long-term month-to-month tenant (20 years), the home already has approved permits to add a 4th bedroom and 2nd bathroom making it larger than most homes in the neighborhood.\n?",
    "negativeKeywords": [
      "financing not available",
      "owner financing not available"
    ],
    "price": 230000,
    "source": "apify-zillow"
  },
  {
    "id": "lwvO6Jc8TmKNsGzDgccW",
    "address": "656 E 126th St, Cleveland, OH 44108",
    "description": "OPPORTUNITY KNOCKS! Fixer upper in Forest Hills! Here is your opportunity to get in a super low entry point! Less than 3 miles from University Circle, get in now during the revitalization. This property is currently a 4 bed, 1 bath property. Property being strictly sold as-is, where-is. Seller has never been to or seen the property. No utilities are currently on, and will not be restored. Cash or Rehab loans only. No sight unseen offers **NO SELLER FINANCING, NO WHOLESALERS, NO ASSIGNMENT CONTRA",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 60000,
    "source": "apify-zillow"
  },
  {
    "id": "m74bKz4F4SqEh8WLcCaJ",
    "address": "15766 Cruse St, Detroit, MI 48227",
    "description": "BEAUTIFUL BRICK BUNGALOW FOR SALE. THIS IS AN EXCELLENT OPORTUNYTY FOR A FIRST TIME BUYER TO MAKE THIS HOUSE THEIR HOME. IT IS LOCATED IN A GREAT BLOCK AND BETTER LOCATION. THIS BEAUTIFUL HOUSE HAS EXCELLENT  LAYOUT, AWESOME SPACE AND GREAT TASTE. YOU WILL FIND A MASTER BEDROOM UPSTAIRS FULLYSPACIOUS WITH WALK IN CLOSET. ALSO, 2 BEDROOMS ON FIRST LEVEL, NICE SIZE LIVINGROOM AND NICE KITCHEN. YOU WILL NEED IT ON YOUR SHOWING LIST.\nFOR SHOWING CONTACT LISTING AGENT.  \nNO SELLER FINANCING.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 110000,
    "source": "apify-zillow"
  },
  {
    "id": "mF8qTq3FfLgqTzyNMGny",
    "address": "3457 Spreading Oak Dr SW, Atlanta, GA 30311",
    "description": "Welcome to this delightful three-bedroom, two-bath brick ranch built in 1958. With 1,564 square feet of living space, this home offers a warm and inviting atmosphere. You'll love the original tile in both bathrooms—one featuring a lovely peach tile and the other a charming baby blue. The home also boasts beautiful hardwood floors throughout and a convenient two-car carport. Additionally, you'll find a full unfinished basement, perfect for storage or future expansion, and a spacious, pretty backy",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 215000,
    "source": "apify-zillow"
  },
  {
    "id": "mHa9JlyK2e17teG6ahOB",
    "address": "3648 Michigan Blvd, Shreveport, LA 71109",
    "description": "This great 3 bedroom home rents for $850 per month. New BTU mini splits installed. Refinished wood floors, new bath tiles and tub refinished. All new waterlines to the road, and added insulation to help with the cooling and heating of the home.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825)",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 69900,
    "source": "apify-zillow"
  },
  {
    "id": "mzixv0LGsjuVNdSNx1ng",
    "address": "9902 Garfield Ave, Cleveland, OH 44108",
    "description": "Opportunity awaits! Solid 3 bed 1 bath Colonial style home in Cleveland's Glenville neighborhood. Property is in need of rehab, so Cash or Renovation Loans only! Property located in Opportunity Zone! No seller financing, no sight unseen offers. Call your favorite agent today before this one is going going gone! AGENTS READ REMARKS.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 65000,
    "source": "apify-zillow"
  },
  {
    "id": "n4L4Duw7mLrxnuIeGLAn",
    "address": "3648 Michigan Blvd, Shreveport, LA 71109",
    "description": "This great 3 bedroom home rents for $850 per month. New BTU mini splits installed. Refinished wood floors, new bath tiles and tub refinished. All new waterlines to the road, and added insulation to help with the cooling and heating of the home.\nThis great home is part of an investment package to be sold all together. The addresses are: 2903 Millard St (MLS 21104808), 7814 Jewella Ave (MLS 21104811), 1507 Viosca St (MLS 21104816) , 271 E Linden St (MLS 21104822), 3648 Michigan Blvd (MLS 21104825)",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 69900,
    "source": "apify-zillow"
  },
  {
    "id": "oBkKinEyAFQuoYnUrC0l",
    "address": "7 Esquiline Dr, Columbus, GA 31903",
    "description": "Looking for an Investment home? Look no further, this adorable 3 bedroom 1 bathroom with a living room, dinning room, sunroom, and fenced in backyard is perfect. Located close to Fort Moore, near shopping, and restaurants. The home is occupied by tenant. SOLD AS IS. NO SELLER FINANCING",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 95000,
    "source": "apify-zillow"
  },
  {
    "id": "oVYS2rhHKp9TFRqQrWGo",
    "address": "603 9th St NE, Springhill, LA 71075",
    "description": "Beautiful 2 story home on quiet dead end street.  4 bedroom and  2.5 baths with 3 bedrooms upstairs.  In ground pool with hot tub and large 2 car garage. Lots of storage with large walk in attic. \nMust be pre-qualified to view.\nNo seller financing or rent to own.\n",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 425000,
    "source": "apify-zillow"
  },
  {
    "id": "p9vJeTJNtS51P9Iw9xQF",
    "address": "14600 Hubbell St, Detroit, MI 48227",
    "description": "LOOKING FOR A MOVE-IN READY CAPE COD ON DETROIT’S WESTSIDE NEIGHBORHOOD? This is it! Perfect for a first-time homebuyer or investor looking for a great opportunity. This home has been completely redone from top to bottom, and all you need to do is move in. 5 bedrooms + 1 full bathroom has all the space you can need.You’ll love the spacious main floor w/ large living rooms & dining room w/ several windows that let in TONS of natural sunlight to make a day at home feel blissful. Updated kitchen w/",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 149000,
    "source": "apify-zillow"
  },
  {
    "id": "pAsH3RLzVHOlsHSy7pKJ",
    "address": "3013 Garden Lakes Blvd NW, Rome, GA 30165",
    "description": "All-Brick Ranch with Classic Charm in Rome, Georgia!    Discover the potential in this four-sides brick ranch featuring three bedrooms and two full bathrooms. This home offers a spacious and flexible layout with plenty of room to make it your own.    Inside, you’ll find hardwood floors, plantation shutters, and two fireplaces—one in the great room and another in the living room—adding warmth and character throughout. The kitchen includes a laundry room conveniently located nearby, and a bright s",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 240000,
    "source": "apify-zillow"
  },
  {
    "id": "q7e93xF5UCb2yjyMIAeU",
    "address": "1493 Oaklawn St, Memphis, TN 38114",
    "description": "This charming 3 bedroom 2 bathroom home is just minutes away from the interstate, and located near multiple parks.  The seller just completed some recent improvements in October 2025 (new paint, new flooring, upgrades to the kitchen, etc).  ONLINE VIDEO AVAILABLE UPON REQUEST.  Home needs further repairs/improvements but could be worth a lot of money once fully rehabbed.  This could be a great primary residence or investment property.  Cash offers only! No wholesalers, no assignments, no owner f",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 75000,
    "source": "apify-zillow"
  },
  {
    "id": "q7ug7WBS7alrqNF15FA6",
    "address": "635 N Merton St, Memphis, TN 38112",
    "description": "Contract contingency View inside then deposit if continue. No wholesale, No Creative Financing, No seller financing, carry back or creative financing. Need Preapproval or Proof of fund before offers. For Investors ONLY. ALREADY LEASED FOR $1200 manage by owner over 2 years. Low taxes and insurance. Updated some of the Virtual Staging for you to see the potential of the property. Sellers Done all repairs Turnkeys for another Investors. Check with your loan originator about no income and no tax re",
    "negativeKeywords": [
      "no seller financing",
      "no creative financing"
    ],
    "price": 134900,
    "source": "apify-zillow"
  },
  {
    "id": "qZeYc3KnRDwym4eEu0PK",
    "address": "4201 10th Ave, Birmingham, AL 35224",
    "description": "BACK ON THE MARKET FOR SHOWINGS AFTER SOME UPDATES.  NEW- kitchen cabinets, sink, stove, fridge, faucets, dishwasher, sockets, water heater, plumbing, toilet, vanity, bathroom floor, down spouts, security doors, locks,  etc. AMAZING OPPORTUNITY FOR A FIRST TIME HOME BUYER OR AN INVESTOR LOOKING TO INCREASE THEIR RENTAL PORTFOLIO. NO SELLER FINANCING or Creative offers.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 85000,
    "source": "apify-zillow"
  },
  {
    "id": "qj67TGigYy5wX47rv0Fu",
    "address": "814 N Merton St, Memphis, TN 38112",
    "description": "Contract contingency View inside then deposit if continue. No wholesale, No Creative Financing, No seller financing, carry back or creative financing. Need Preapproval or Proof of fund before offers. For Investors ONLY. ALREADY LEASED FOR $1100 manage by Licensed Property Management with $100 a month of management fee. Low taxes and insurance. Updated some of the Virtual Staging for you to see the potential of the property. Sellers Done all repairs Turnkeys for another Investors. Check with your",
    "negativeKeywords": [
      "no seller financing",
      "no creative financing"
    ],
    "price": 134900,
    "source": "apify-zillow"
  },
  {
    "id": "rP29Xv9MsKBQdJVGAak0",
    "address": "2513 N Carroll Ct, Villa Rica, GA 30180",
    "description": "Welcome to this charming home in the heart of Villa Rica — full of character and potential! The main level offers a spacious layout featuring a large living room with a cozy fireplace, perfect for relaxing or entertaining. With two comfortable bedrooms and two full bathrooms, this home is ideal for those seeking a manageable floor plan with room to grow. The unfinished basement offers endless possibilities — create a workshop, recreation room, or additional living space to suit your needs. A two",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 200000,
    "source": "apify-zillow"
  },
  {
    "id": "sMaKH8PRBzHPmk8UuTuE",
    "address": "1014 S 3rd St, Temple, TX 76504",
    "description": "This home represents an excellent value for the price. You can move in immediately, while still building sweat equity from the cosmetic upgrades needing to take place. There is an outbuilding with power as well that could be made into an office or powered workshop. In addition to cash or conventional loan offers, the seller is willing to owner finance the property. It is a short walk or drive to the VA hospital, and many other things Temple has to offer. Whether you are looking for your next inv",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 99000,
    "source": "apify-zillow"
  },
  {
    "id": "tTqTuXZYmzkjQhZojH6a",
    "address": "2961 Hawk Ct SE, Marietta, GA 30067",
    "description": "Renovated house close to Delk Road. Excellent East cobb schools. All house has high ceilings 10ft. Eat in kitchen with bay windows and access to New deck on back yard. Two car garage. Updated kitchen and baths. Fenced backyard. Sky windows in bathrooms. Master closet has custom made shelves. The other bedroom has double closets. Washer and dryer area has storage space. Backyard is small, but it is fenced and private. All house has LVF flooring. Agent is a member of the entity that owns the prope",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 319900,
    "source": "apify-zillow"
  },
  {
    "id": "uQAqgLoVmPFcyoI3a1aS",
    "address": "2057 S Saunders St TRAILER 23, Aransas Pass, TX 78336",
    "description": "REDUCED BY $15,000.  \n2024 16’ X 76’ , 3 Bdrm, 2 Bthrm Clayton very well-built mobile home. \nAre you looking for an alternative to the high price of housing in the south Texas area?\nThis 2024, 3 bedroom, 2 full bathrooms mobile home has a specialized energy efficient package, including double-paned windows, extra additional insulation, energy efficient HVAC, hot water heater, and appliances. The windows also fold in for easy cleaning.  \nThis beautiful home is in like new condition, was bought ne",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 95000,
    "source": "apify-zillow"
  },
  {
    "id": "uetuU4TxIDtWStP4qRnd",
    "address": "150 Joseph E Lowery Blvd SW, Atlanta, GA 30314",
    "description": "Great opportunity for an investor / or someone looking for city convenience. Great for student housing, rooming and so much more. In walking distance to the AU center/ just steps away from Morehouse College.   This property boasts 4bedrooms /3 full baths with one bedroom downstairs connected to a full bath. The home was recently updated with new floors throughout. Price  reflects its current condition with the AC's and heating line removed from the home. This home is in excellent condition other",
    "negativeKeywords": [
      "no owner financing",
      "cash or conventional"
    ],
    "price": 315000,
    "source": "apify-zillow"
  },
  {
    "id": "vA9KH7gHNHbFX6wth5Eb",
    "address": "4874 Larkspur Ln, College park, GA 30349",
    "description": "Look no further, this gorgeous 3-bedroom 2-bathroom ranch on a corner lot can be your dream home. It has a large family room with a fireplace, this amazing home is located in the highly sought after Creekside Subdivision. It features a large master bedroom, master bath, Jacuzzi tub, separate shower, double vanity, and walk in closet. The kitchen has an eat in breakfast area, stainless steel appliances and laundry closed for both gas and electric dryer. A beautiful new roof was just completed on ",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 265000,
    "source": "apify-zillow"
  },
  {
    "id": "vUMxQfMXSWG0s5tw0B8Q",
    "address": "6 Wavecrest Pl, Palm Coast, FL 32164",
    "description": "This spacious 5 year old 4 bedroom 2 bath home is located in the Pine Lakes Subdivision. Open concept with living room and kitchen separated by a large kitchen island for entertaining and space for cooking. Living room opens onto the lanai with sliding glass doors and your view in the back yard is a beautiful wooded area for privacy. The kitchen boasts a walk in closet, large refrigerator and that center island is amazing. Master bedroom features lovely 17 x 14 room with tray ceilings and walk i",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 389000,
    "source": "apify-zillow"
  },
  {
    "id": "w3VunEGnbvjZzA3xbKoz",
    "address": "141 S Barat Ave, Saint Louis, MO 63135",
    "description": "Investor Special – 3 Bed / 1 Bath in Ferguson!\nAre you looking for your next remodel, flip, or a great rental to add to your portfolio? This 3-bedroom, 1-bathroom home offers 1,166 sq. ft. of potential. The property needs work and will be sold as-is, giving savvy buyers the perfect opportunity to add value.\n\nPlease schedule your showing and complete all due diligence. No creative financing, no owner financing – serious buyers only.\n\nOpportunities like this in Ferguson don’t last long—make your m",
    "negativeKeywords": [
      "no owner financing",
      "no creative financing"
    ],
    "price": 69950,
    "source": "apify-zillow"
  },
  {
    "id": "wDjoho2Uy5nFnqYbVEqq",
    "address": "5788 Lawndale St, Detroit, MI 48210",
    "description": "Great investment opportunity in the heart of Southwest Detroit! This multi-use property offers excellent visibility and frontage on Lawndale Street, making it ideal for a small business, office, or potential redevelopment. Located near schools, parks, and major freeways, the property benefits from high traffic and strong community presence. Don’t miss your chance to own in one of Detroit’s most vibrant and growing neighborhoods. Property is sold as-is. Buyer and buyer’s agent to verify all infor",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 100000,
    "source": "apify-zillow"
  },
  {
    "id": "wmvp98RWcqd0bMGZnPLk",
    "address": "1505 S Austin St, Sherman, TX 75090",
    "description": "TRUE INVESTORS DELIGHT!! This clean slate property with farmhouse feel is ready for you put your designer touches to use.   This 3 bedroom 1.5 bath home has large bedrooms, original hardwood throughout, gas central heat, huge back yard with 2 out buildings. All Items located inside home will convey with property example toilets, tile, bath vanity, etc.... (if any, tools and ladders do not convey) Survey is not available and will be at buyers expense. CASH or HARDMONEY is welcome!! No seller fina",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 115000,
    "source": "apify-zillow"
  },
  {
    "id": "xWSjy0aOeCmiPm4cRyJ1",
    "address": "6539 Wimble Rd, Memphis, TN 38134",
    "description": "INVESTORS ONLY! Tenant occupied property being marketed to investors. This can be a great addition to your rental portfolio. Property is Professionally managed by Mid South Home Rentals. Currently rented at $1,350/mo. This home was renovated in early 2025. ONLINE VIDEO AVAILABLE UPON REQUEST. No sign. PLEASE DO NOT APPROACH OR DISTURB TENANT. Make all offers contingent on an interior inspection. No wholesalers, no assignments, seller is not interested in owner financing or subject-to offers. CAS",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 126900,
    "source": "apify-zillow"
  },
  {
    "id": "yDqIjnLH1FmFfUuaWFmu",
    "address": "2134 Eve Cir, Charleston, SC 29414",
    "description": "Endless potential in a prime location situated on a cul-de-sac  with a marsh-view. Nestled on Church Creek home is ideal for entertaining and relaxing. Property is in need of major repairs(renovations). Cash buyers only. no owner financing available.",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 334000,
    "source": "apify-zillow"
  },
  {
    "id": "z0HssSos82OU9pHMXcLU",
    "address": "401 Southern Rd #3, Ellijay, GA 30536",
    "description": "For Sale By Owner: 4.17 Acres in Gilmer County sold in 2 tracts on Southern road.\nPLEASE READ ENTIRE POST. HOUSE HAS NO VALUE. WILL NEED TO BE TORE DOWN AND CLEANED UP. VALUE IS IN THE LAND AND IMPROVEMENTS.\nA rare opportunity to purchase a secluded and private 4.17-acre tract on Southern Rd in Gilmer County. Perfect for anyone looking to build their custom home or cabin retreat.\nProperty Features and Value\nThis acreage is beautiful, private, and already set up with critical infrastructure, savi",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 200000,
    "source": "apify-zillow"
  },
  {
    "id": "z7P7Cws6uuMHKwqxUAYw",
    "address": "3 Porter St SW, Rome, GA 30161",
    "description": "For SALE by Owner. Not for rent.\nOwner financing not available.\n\nSpacious, renovated 3 bed, 2 bath home with primary en suite in South Rome.  Completely re-wired and re-plumbed.  New kitchen cabinets (no particle board!) with soft-close doors and drawers, new stainless steal appliances, granite countertops, and laundry closet for stackables.  Beautiful understated LVP and carpet. Large deck in back to enjoy throughout the year!  Less than 5 minutes to downtown Rome!  Walkable to Anna K. Davies E",
    "negativeKeywords": [
      "financing not available",
      "owner financing not available"
    ],
    "price": 219900,
    "source": "apify-zillow"
  },
  {
    "id": "zIdD64fQt5RvyzgNhgZ3",
    "address": "810 Avenue L, Sunray, TX 79086",
    "description": "FOR SALE BY OWNER: 4 Bedrooms. 2.5 bathrooms. 2096 sqft.\nSelling As Is. Cash or Conventional. NO Owner Finance. Offering concessions with an appropriate offer.\n\nSpacious 2 story home in a family-friendly neighborhood in Sunray with plenty of storage space and updates. Within walking distance to schools, park, grocery store and restaurants.\n\nSeveral updates include: metal roof, fenced yard, newer windows and central heat/hair, plumbing and wiring. Newer carpet (2023) upstairs, on stairs and in ma",
    "negativeKeywords": [
      "cash or conventional"
    ],
    "price": 145700,
    "source": "apify-zillow"
  },
  {
    "id": "zhczvStWKUNiRGCUZ47y",
    "address": "3518 SUNSET Street, Jacksonville, FL 32254",
    "description": "Welcome to this beautifully refurbished 3 bedroom home on a well kept street on Jacksonville's west side. The home has been tastefully remodeled with tiled entry and bath, new luxury vinyl plank flooring, new windows, and quartz countertops. The spacious back yard is fully fenced with gates on both sides of the home for easy access and features a storage shed for all of your yard and gardening needs. Other recent upgrades include HVAC, water heater, roof replacement (2023), electric panel (2023)",
    "negativeKeywords": [
      "no creative financing"
    ],
    "price": 179900,
    "source": "apify-zillow"
  },
  {
    "id": "zpOu1tx2vJyE3h1eFUqR",
    "address": "225 E Bergey St, Wadsworth, OH 44281",
    "description": "Welcome to this beautifully renovated home in the heart of Wadsworth! Recently updated and rehabbed, this property is move-in ready and perfect for the end buyer looking for a clean, turnkey home. Enjoy the peace of mind that comes with modern updates while still being just minutes from local schools, parks, and downtown amenities.\nThis property is selling as is no repairs will be made by the seller. It s priced to sell quickly, offering tremendous value for the location and recent improvements.",
    "negativeKeywords": [
      "no seller financing"
    ],
    "price": 199000,
    "source": "apify-zillow"
  },
  {
    "id": "zzzgHJdnGVRVftNSI9UB",
    "address": "106 Villa Dr #106, Osprey, FL 34229",
    "description": "Located West of the Trail in Sorrento Shores, Osprey, this spacious 2BR/2BA villa with a den and oversized 1-car garage offers 1,578 sq. ft. of comfortable living space. A boating community with private dock access and a heated pool just steps away, it s perfect for boaters, kayakers, or anyone seeking the coastal lifestyle. Features include hurricane-rated windows and doors, updated kitchen and baths with granite countertops, and a private walled courtyard ideal for entertaining. Home is curren",
    "negativeKeywords": [
      "no owner financing"
    ],
    "price": 249900,
    "source": "apify-zillow"
  }
]