{
  "timestamp": "2025-11-25T22:39:50.784Z",
  "summary": {
    "total": 1184,
    "validOwnerFinance": 1164,
    "falsePositives": 19,
    "noDescription": 1
  },
  "falsePositives": [
    {
      "id": "1srDdbhzT1eYE5QC4o0E",
      "address": "",
      "city": "Aiken",
      "state": "SC",
      "source": "zillow",
      "reason": "[high] The description mentions special financing with a preferred lender and specific interest rates, but it does not indicate any owner or seller financing options. It focuses on traditional financing through a mortgage company.",
      "description": "SPECIAL FINANCING W/ SPECIAL INTEREST RATE AS LOW AS 4.99% AND UP TO 6,000 IN SELLER PAID CLOSING COST W/PREFERRED LENDER FOR QUALIFIED BUYERS THAT CLOSE BY 2/28/256.\nThe Mansfield floor plan. Get everything on your list at The Abbey at Trolley Run. Enjoy Southern charm in a quiet location, just minutes from I-20 & Historic Downtown Aiken. USC Aiken, Aiken Technical College and Aiken Regional Medical Center are a quick drive away. For recreation, you'll be adjacent to the YMCA, in close proximity to Hitchcock Woods, while enjoying The Abbey's pool. The Mansfield offers a 3-car garage & the extra space you want. You will never be too far from home with Home Is Connected. Your new home is built with an industry leading suite of smart home products that keep you in touch. The central kitchen boasts an island & opens to a spacious breakfast area and family room. A guest bedroom with full bath offers the perfect retreat for visitors on the main level, plus there's a convenient powder room. Upstairs includes a versatile loft for recreation or extra casual living space, large secondary bedrooms, & a private bedroom suite with spa-like bath. Photos used for illustrative purposes.\nFinancing offered by DHI Mortgage Company, Ltd. (DHIM). Branch NMl5 1679072. 4234 Wheeler Rd., Martinez, GA 30907. Company NMl5 14622. DHIM is an affiliate of D.R. Horton. For more information about DHIM and its licensing please visit http://www.dhimortgage.com/affiliate. All terms and conditions subject to credit approval, market conditions and availability. D.R. Horton has locked-in, through DHIM, a fixed interest rate for a pool of funds. Rates only available until pool of funds is depleted or rate expires. Interest rate offered applies only to the D.R. Horton family of brand properties purchased as borrower's principal residence. Rate is not applicable for all credit profiles and may require borrower to pay points to obtain the advertised rate. Restrictions apply. Buyer is not required to finance through DHIM to purchase a home; however, buyer must use DHIM to receive the advertised rate. Additional dosing costs will apply. Please contact your Mortgage Loan Originator for complete eligibility requirements. May not be able to be combined with other available D.R. Horton offers or discounts. Contact a D.R. Horton sales representative for more information and for a list of available homes. Property restrictions apply. Photos are representational only. Equal Housing Opportunity. APR Annual Percentage Rate. HOA Homeowners Association. FHA Federal Housing Administration. VA U.S. Department of Veterans Affairs. USDA U.S. Department of Agriculture. SBC Standby Commitment. REV: 05/22/24 I Expires on the close by date listed above.\nEstimated completion is February 2026."
    },
    {
      "id": "46fDmB6PgQoLXXhM8Miy",
      "address": "",
      "city": "Rockingham",
      "state": "NC",
      "source": "zillow",
      "reason": "[high] The description explicitly states that owner financing is not available.",
      "description": "Nice 3 bedroom, 1 bath house. Big two car garage. Huge fenced in yard. Huge pool with new liner. Security cameras and system will come with house. Must be able to purchase, or get a loan. Cannot do owner financing. Contract will go through a title company (realtor lawyer). Listing estimate is base on upgrades. An appraisal can be done. Feel free to contact me and talk about it. Do not contact me if you are a realtor wanting me to let you sale my house for me. 960 Airport Rd. Albert....970-397-0495. thank you and God bless"
    },
    {
      "id": "6eAIjYKAg8ggg1AS235d",
      "address": "",
      "city": "Dallas",
      "state": "TX",
      "source": "zillow",
      "reason": "[medium] The description mentions flexible financing and creative financing options, but it primarily refers to working with a preferred lender and does not explicitly indicate owner or seller financing terms.",
      "description": "?? COMING SOON Fully Renovated & Ready to Impress!\n?? List Price: $250,000 ?? Flexible Financing Available!\nWhile renovations are being completed, a qualified buyer working with our preferred lender can get pre-approved now and take advantage of creative financing options that make homeownership easy.\n? Highlights:\n3 Bed 1 Bath 1,080 Sq Ft\nFully Updated: New HVAC, roof repairs, foundation leveling, modern kitchen & bath, new siding, flooring, and paint\nPrime Location: Across from Dallas Can Academies, on the city bus line, and surrounded by new builds & renovations!\n?? Financing Options:\n2-1 Buydown: Lower monthly payments (as low as $1,350-mo. in Year 1--estimate)\nDown Payment Assistance: Low cash to close\nPrograms can be combined with our preferred lender for maximum savings\n?? Contact:\nSteven Moning\nMoning & Associates Group eXp Realty\n?? 469-580-9228 ?? steven.moning@exprealty.com\n?? Preferred lender financing available. Terms subject to buyer qualification."
    },
    {
      "id": "9PSVzmLLhalxBcOJ0GeV",
      "address": "",
      "city": "Fort Myers",
      "state": "FL",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options; it focuses on traditional sale conditions and requirements.",
      "description": "14-day listing!!! Discover an incredible opportunity to own a first-floor condo in a community that s undergoing a full-scale transformation perfect as a primary residence or investment rental property. This unit offers a direct view of the newly paved parking area and is part of a neighborhood focused on quality upgrades and long-term value.\nThe home is sold as-is, so buyers are encouraged to complete all due diligence prior to submitting an offer. A proof of funds letter must accompany all offers.  that escalation clauses will not be accepted, and an escrow deposit equal to 5% of the purchase price will be due within three days of contract acceptance.\nA Phase I and II Milestone Report is available directly from the association. These reports outline the repairs and renovations planned for the community, that caused a special assessment for the community. The special assessment is prepaid for the buyer in full at closing, giving the new owner the benefit of major community upgrades.\nThe community improvements include:\nNew staircases and balconies\nImpact-rated hurricane windows and doors\nFresh exterior paint for all buildings\nA resurfaced and beautifully updated pool and spa area\nNewly paved parking lot (already completed)\nThese enhancements will not only elevate the community s curb appeal but also add long-term value and durability to the property.\nAs an added bonus, the seller is offering a special incentive of prepaid HOA dues for three months at closing, totaling $1,194. This makes it even easier for the new owner to settle in and enjoy the benefits of this revitalized community.\nThis condo represents a prime opportunity for both homeowners and investors. With the community improvements already funded and underway, it s an ideal choice for those seeking a low-maintenance primary home or a strong rental investment with future appreciation potential.\nConveniently located near shopping, dining, schools, and major highways, this condo offers both comfort and convenience for residents and strong rental potential for investors. Here is your chance to own a property in a community on the rise where the hard work and major improvements are already underway and paid for. Schedule your showing today and see the potential this property has to offer!"
    },
    {
      "id": "CdLyit0wnebwSGjYvT1N",
      "address": "",
      "city": "Fort Myers",
      "state": "FL",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing or seller financing terms.",
      "description": "Spacious 2nd-Story Carriage Home with a 2 CAR GARAGE, located in the prestigious Gulf Harbour Yacht & Country Club in Fort Myers. This 3-Bed, 2-Bath condo--offered furnished and turnkey--has been thoroughly updated from head-to-toe: lighting, fans, fixtures, paint, flooring, trim, and even new stair railings and balusters. As a CORNER UNIT, loads of natural light pour into the upstairs bar, kitchen and dining areas. The kitchen cabinets were refinished and upgraded with crown moulding, granite countertops and tile backsplash, and the space further updated with LG stainless steel appliances, and a new sink / faucet / garbage disposal. The north-easterly facing lanai is cool and shaded year-round and makes for a lovely place to enjoy a morning coffee or afternoon siesta. It has been enclosed with plexiglass sliders which insulate the space from noise and heat, but can easily be opened to allow for cool breezes to pass through. The primary bedroom has two walk-in closets and a fully remodeled ensuite bathroom with an oversized shower with frameless glass enclosure, linen closet, premium cabinetry and a pedestal sink which maximizes maneuverability. Two guest bedrooms share a jack-and-jill style bathroom with separate vanities and combined shower that has been updated with new tile. Located within the Tamarind Cay subdivision of Gulf Harbour, this enclave has a stunning amenity center with spacious pool for the exclusive use of residents within Tamarind Cay (who are fun and have a vibrant social calendar full of regular events for everyone who wishes to participate). From dinner nights out at local restaurants to luncheons, special interest groups, holiday gatherings, super bowl parties, and weekly samba, mahjong and water aerobics! The community pool is just a short 2-minute stroll under the canopy of lovely shade trees and offers indoor amenities for your convenience. Residents have the OPTION to join the golf or sports membership options at the Gulf Harbour Clubhouse, or to dock their boat in the marina by purchasing or renting a slip. There is a yacht club for those who do, and a state-of-the-art fitness center with smoothie bar and multiple dining options. But even if you decide not to join the larger club you can still enjoy strolling through the entire community, through the marina to the bell tower at the end of the harbour and back for wonderfully peaceful views and great exercise. Gulf Harbour is the crown jewel community of Fort Myers with spectacular access to area fishing, beaches, shopping, restaurants, HealthPark hospital, and the best public and private schools in the area and the community has excellent WALKABILITY. For more information, ask your agent for a full list of features and amenities... then schedule your private tour today!"
    },
    {
      "id": "DfXXZMnh70Jqe3LLj17p",
      "address": "",
      "city": "Jackson",
      "state": "MS",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options; it focuses on the investment opportunity and tenant occupancy.",
      "description": "Attention investors! This is a turnkey rental investment opportunity. The property is tenant-occupied on month-to-month leases, allowing flexibility for new ownership either secure new long-term tenants or have the property delivered vacant at closing.\nWell-maintained with no open maintenance requests and no delinquent rent payments, the unit has a proven track record of stable occupancy and reliable cash flow.\nThis property is part of a larger investment portfolio of income-producing homes, all tenant-occupied and managed with care. Perfect for investors seeking immediate cash flow with minimal management headaches or for those looking to scale their holdings quickly with occupied, performing assets."
    },
    {
      "id": "EC0uTJNmwJ6bwmOOTCxc",
      "address": "",
      "city": "san antonio",
      "state": "TX",
      "source": "zillow",
      "reason": "[high] The description explicitly states that the sellers will not consider subject-to or 'creative' finance, indicating a lack of owner financing options.",
      "description": "Step into a beautifully updated 3-bedroom, 2-bathroom haven, perfectly situated near Loop 1604 and I-35. As you glide through the stunning double doors, you'll be welcomed by an expansive open-concept layout that radiates warmth and elegance. The inviting living area is anchored by a captivating wood-burning fireplace, creating a cozy focal point for gatherings and quiet evenings alike. The kitchen is a chef's dream, bright and inviting, showcasing custom cabinetry that offers both style and functionality. Luxurious quartz countertops shimmer under the soft lighting, while the generous island, complete with seating, beckons friends and family to gather for delightful meals and lively conversations. Throughout the home, exquisite tile flooring flows seamlessly, enhancing the polished aesthetic and adding a touch of sophistication to every room. The separate formal dining room offers versatility, easily transforming into a cozy living space that suits your lifestyle needs. Retreat to the expansive owner's suite, a true sanctuary with ample space and striking custom barn doors that add a unique charm. Both bathrooms have been meticulously remodeled with high-end finishes, providing a spa-like experience that invites relaxation and rejuvenation. The curb appeal of this home is exceptional, highlighted by a charming front courtyard and lush, mature trees that create a serene atmosphere. The covered back patio is perfect for outdoor living, inviting you to unwind or entertain in a peaceful setting. Freshly painted and impeccably maintained, this home is truly move-in ready. Don't miss the opportunity to make it yours-schedule your private showing today! For RENT also. Please note that the sellers are motivated and open to all offers but will not consider subject-to or \"creative\" finance. Step into a beautifully updated 3-bedroom, 2-bathroom haven, perfectly situated near Loop 1604 and I-35. As you glide through the stunning double doors, you'll be welcomed by an expansive open-concept layout that radiates warmth and elegance. The inviting living area is anchored by a captivating wood-burning fireplace, creating a cozy focal point for gatherings and quiet evenings alike. The kitchen is a chef's dream, bright and inviting, showcasing custom cabinetry that offers both style and functionality. Luxurious quartz countertops shimmer under the soft lighting, while the generous island, complete with seating, beckons friends and family to gather for delightful meals and lively conversations. Throughout the home, exquisite tile flooring flows seamlessly, enhancing the polished aesthetic and adding a touch of sophistication to every room. The separate formal dining room offers versatility, easily transforming into a cozy living space that suits your lifestyle needs. Retreat to the expansive owner's suite, a true sanctuary with ample space and striking custom barn doors that add a unique charm. Both bathrooms have been meticulously remodeled with high-end finishes, providing a spa-like experience that invites relaxation and rejuvenation. The curb appeal of this home is exceptional, highlighted by a charming front courtyard and lush, mature trees that create a serene atmosphere. The covered back patio is perfect for outdoor living, inviting you to unwind or entertain in a peaceful setting. Freshly painted and impeccably maintained, this home is truly move-in ready. Don't miss the opportunity to make it yours-schedule your private showing today! For RENT also. Please note that the sellers are motivated and open to all offers but will not consider subject-to or \"creative\" finance."
    },
    {
      "id": "JYpvLy0MLOW0bzAEAhAw",
      "address": "",
      "city": "Orlando",
      "state": "FL",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options.",
      "description": "Excellent investment opportunity in downtown Orlando. This duplex has been exceptionally maintained and features two bedrooms and one bath, laundry rooms plus carports on each side. One side is currently vacant so you can live in one side and rent the other if you choose. Current tenant has lease until March, 2026. Location is close to shopping, schools, restaurants, public transportation and more. New roof installed in March, 2024, entire exterior painted in 2023, all new doors and windows replaced in the last 3 - 4 years. Unit 1104 had new a/c installed in September 2025 and new hot water heater approx. 3 - 4 years ago. Unit 1106 had new refrigerator in 2024. This duplex is very clean and ready for a new tenant or owner occupant."
    },
    {
      "id": "KjNka65iTIYJozZCffuy",
      "address": "",
      "city": "saint augustine",
      "state": "FL",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or keywords related to seller financing.",
      "description": "Welcome to this exceptional three-story coastal retreat on Anastasia Island, where modern elegance meets island charm. Situated on one of the highest lots in the neighborhood, this home offers rare peace of mind with no history of flooding, a true standout in the area. Featuring 4 bedrooms and 3.5 bathrooms, this spacious and thoughtfully designed home includes two luxurious master suites. The first-floor suite provides private access to the backyard through sliding glass doors ideal for guests or multigenerational living. Upstairs, the third-floor master suite showcases breathtaking views of the Intracoastal Waterway and historic St. Augustine, where you can unwind and enjoy unforgettable sunsets from the comfort of your own home. The second floor is the heart of the home, offering a gourmet kitchen with stainless steel appliances, quartz countertops, and crisp white shaker cabinetry, flowing seamlessly into an open living space with access to a spacious deck overlooking the water perfect for entertaining or simply soaking in the views. Throughout the home, luxury vinyl plank flooring adds a warm, contemporary touch. Outside, the fully fenced backyard provides privacy and endless possibilities plenty of room to add a pool, or to store a boat, RV, or other toys. With no HOA restrictions, you have the freedom to truly make the space your own. Whether you re seeking a primary residence, a vacation home, or a short-term rental investment (yes, short-term rentals are allowed), this property checks every box. Just minutes from the beach, Anastasia State Park, the lighthouse, and vibrant downtown St. Augustine, you ll enjoy the very best of Florida s coast and history right at your doorstep. Long-term lease options may also be considered. Schedule your private showing today and experience the very best of coastal Florida living!"
    },
    {
      "id": "KoPE8fXu3UpktDIGigO1",
      "address": "",
      "city": "Joliet",
      "state": "IL",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options; it focuses on the property's features and condition.",
      "description": "BACK ON THE MARKET BUYER COULD NOT GET LOAN APPROVED Location-Location-LocationLooking for the perfect home to start a family or a great rental property close to shopping, schools and restaurants, 2/3 bedrooms with dining room, living room, and kitchen, hardwood floors, one bath, full basement, siding and roofing new within the last year, windows within the last 3 years, fenced in backyard, a shed for extra storage, walk up attic for more extra storage, seller is saying bring me the right offer. home being sold as is. OWNER STILL NEEDS TO MOVE SOME ITEMS N CLEAN."
    },
    {
      "id": "MgNvkRjZ8gzqobeoEzuU",
      "address": "",
      "city": "Kannapolis",
      "state": "NC",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or keywords.",
      "description": "Investor owned - being sold AS IS. Was tenant occupied. Nestled into quiet neighborhood. Owners have little knowledge of property as it was leased upon purchase. Kitchen was updated with new cabinets and counter tops prior to purchase."
    },
    {
      "id": "RVbPtNT626ew5Fj8EDHS",
      "address": "",
      "city": "Hollister",
      "state": "MO",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing or seller financing terms.",
      "description": "Welcome! You have arrived at 161 Foggy Bay Ln. in Hollister, MO. As part of the coveted subdivision of Branson Canyon, this gorgeous, cozy retreat is conveniently located less than 15 minutes from some of the Branson area's most iconic hotspots like: Thunder Ridge Nature Arena, Top of the Rock/Big Cedar dining & golf, Table Rock Lake, College of the Ozarks, and much more. But this isn't just any home, it's an Airbnb superstar! Guests rave about the property's location, amenities, and welcoming vibes, earning it a glowing 5-Star reputation and ranking it in the Top 5% of homes in the area. Not to mention, it's being sold FULLY FURNISHED. Perfect for the next owner to carry the nightly rental torch or settle in to their new primary residence right away. On the main floor: A spacious primary bedroom and an en suite bathroom, including a walk-in shower and jetted soaking tub, as well as the first guest bedroom/full bathroom off of the living area. Right upstairs are 2 more guest rooms and a 3rd full bathroom. The vast, soaring ceilings enhance this home's spaciousness, while the rustic charm throughout provides the perfect balance of comfort that will make anyone feel right at home. The property also features its own private hot tub, as well as access to the Branson Canyon community perks: pools, splash pad, clubhouse, gym, hiking trails, basketball court and playground. So, whether you're ready to start (or add to) your investment portfolio, or snuggle into your new dream home, 161 Foggy Bay is the one! Please enjoy your visit!"
    },
    {
      "id": "hYJOWYV0Z5XMeE8w5uN9",
      "address": "",
      "city": "Graniteville",
      "state": "SC",
      "source": "zillow",
      "reason": "[high] The description mentions special financing through a preferred lender and traditional loan options, but does not indicate owner financing or seller financing terms.",
      "description": "SPECIAL FINANCING W/ SPECIAL FIXED INTEREST RATE AS LOW AS 4.99% AND UP TO 6,000 IN SELLER PAID CLOSING COST W/PREFERRED LENDER FOR QUALIFIED BUYERS THAT CLOSE BY 1/31/26. Highland Hills is an incredible swim community with a private neighborhood pool, cabana, playground, basketball court streetlights, and sidewalks. Highland Hills is conveniently located less than one mile from great schools, and I-20. The Aria. Gather round the chef inspired kitchen that flows into the family room and a casual dining area where friends and family can linger. Escape to a private bedroom suite with spa-like bath, spacious secondary bedrooms invite natural light and features plenty of extra storage. And you will never be too far from home with Home Is Connected. Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes do not depict actual homes. Financing offered by DHI Mortgage Company, Ltd. (DHIM). Branch NMl5 1679072. 4234 Wheeler Rd., Martinez, GA 30907. Company NMl5 14622. DHIM is an affiliate of D.R. Horton. For more information about DHIM and its licensing please visit http://www.dhimortgage.com/affiliate. All terms and conditions subject to credit approval, market conditions and availability. D.R. Horton has locked-in, through DHIM, a fixed interest rate for a pool of funds. Rates only available until the pool of funds is depleted or rate expires. Interest rate offered applies only to the D.R. Horton family of brand properties purchased as borrower's principal residence. Rate is not applicable for all credit profiles and may require the borrower to pay points to obtain the advertised rate. Restrictions apply. Buyer is not required to finance through DHIM to purchase a home; however, buyers must use DHIM to receive the advertised rate. Additional dosing costs will apply. Please contact your Mortgage Loan Originator for complete eligibility requirements. May not be able to be combined with other available D.R. Horton offers or discounts. Contact a D.R. Horton sales representative for more information and for a list of available homes. Property restrictions apply. Photos are representational only. Equal Housing Opportunity. APR Annual Percentage Rate. HOA Homeowners Association. FHA Federal Housing Administration. VA U.S. Department of Veterans Affairs. USDA U.S. Department of Agriculture. SBC Standby Commitment. REV: 05/22/24 I Expires on the close by date listed above."
    },
    {
      "id": "kQSmryZ5dYWAtXxYDbUG",
      "address": "",
      "city": "Saint Louis",
      "state": "MO",
      "source": "zillow",
      "reason": "[high] The description explicitly states that seller financing is not an option.",
      "description": "Fantastic investment opportunity! This 2-bedroom, 1-bath home offers 938sq ft of comfortable living space and is currently rented for $1050/month, with a lease in place 5/1/24 through 4/30/26. The property provides immediate cash flow with a stable tenant already in place.  seller financing is not an option."
    },
    {
      "id": "p6LsCljV8eGtjhZvgspm",
      "address": "",
      "city": "Butte",
      "state": "MT",
      "source": "zillow",
      "reason": "[high] The description explicitly states that owner financing is not an option.",
      "description": "First time home buyer or investor opportunity!\nManufactured home (1995) situated on three city lots in a quiet established neighborhood. The home features a new furnace (October 2024), central air conditioning (June 2025), and a newer roof (2020). The land features an underground sprinkling system, fully fenced yard, a lovely private brick patio and an oversized detached garage.\nThe price reflects some work that needs to be finished and some of the materials to finish the projects are included.\nManufactured home is titled and will be de-titled at time of sale.\nHome is owner occupied and all showings are by appointment only. You are welcome to drive by but please respect our privacy.\nCash or third-party financing. Owner financing is not an option."
    },
    {
      "id": "pKvgKrI8gpIsXsmKUtmP",
      "address": "",
      "city": "san antonio",
      "state": "TX",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options.",
      "description": "Starter home for a growing family, this roomy 3 bedroom 2 bath house also comes with an additional 1 bedroom 1 bath detached mother-in-law suite in the back yard. As is. Includes a detached single car garage as well as a car port. A recently updated roof was installed 3 year ago as well as new hot water heater. For the investor buyer, the house has been consistently occupied for the past five years with strong rental history. Short distance to either Fort Sam Houston or downtown. So much potential!"
    },
    {
      "id": "rlL3F0KxlHF8FkKGpih5",
      "address": "",
      "city": "Kellyton",
      "state": "AL",
      "source": "zillow",
      "reason": "[high] The description only mentions requirements for cash offers and traditional financing, with no indication of owner financing or seller financing options.",
      "description": "ALL offers must have POF for CASH offers and Lender PQ's for Financed offers. Cash offers require 10% EMD. Rehab Offers must have one rehab bid in hand pre-offer, no exceptions. Please be advised that any offers on this property require a minimum Earnest Money Deposit of 1% of the Purchase Price or $1,000, whichever is greater. All initial offers must be submitted via PropOffers.com by the BUYER AGENT ONLY. The MLS comments and any other advertisements must state that all offers must be submitted on PropOffers.com. TO ENSURE PROPER DISCLOSURE IN YOUR MLS, PLEASE ENSURE THAT YOU STATE THE FOLLOWING IN YOUR 'AGENT TO AGENT' REMARKS SECTION OF THE MLS: BUYER'S AGENT IS TO PAY A $200.00 PLUS SALES TAX OFFER MANAGEMENT FEE AT CLOSING OF ANY ACCEPTED OFFER. By accepting below, you are signing this Agreement electronically and by doing so you agree that your electronic signature is the legal equivalent of your manual execution of this Agreement as if actually signed by you in person. You understand and agree that you will be held as legally bound, obligated, and responsible for any electronically signed agreement you make in the same manner and to the same extent as you would be by making such agreement in hard copy form with your handwritten signature."
    },
    {
      "id": "tPH65CzSIGhj9LfTcoSF",
      "address": "",
      "city": "Hamilton",
      "state": "TX",
      "source": "zillow",
      "reason": "[high] The description mentions a 'seller financed foreclosure' but does not indicate that the property is currently being offered with owner financing or seller financing terms.",
      "description": "Nice property located on the edge of Hamilton on paved FM 1241. This is a distressed property that needs extensive clean extensive clean-up after a seller financed foreclosure. The home is a solid older brick home that was completely renovated several ago that included metal roof, vinyl windows, refinished original wood floors, large game room or den with tile floors and wood stove. This home has 252 sq ft of living area with 3 bedrooms and 2 baths. The home site back off of the road on a hill with very nice views across the native grass pasture leading down to a small pond. There are enough trees at the back of the property to support some wildlife and offers decent hunting. The property is fully fenced and has good native grass for grazing livestock."
    },
    {
      "id": "v3rEZoOfjrUhXykzFESq",
      "address": "",
      "city": "Sahuarita",
      "state": "AZ",
      "source": "zillow",
      "reason": "[high] The description does not mention any owner financing terms or options; it focuses on the property features and amenities.",
      "description": "Fantastic opportunity for desirable single story 2,076 SqFt 3 bed/2 full bath plus den, split floor plan, 2019 modern contemporary with 440 SqFt attached 2 car finished post tension garage in Entrada Del Rio neighborhood nestled in the award-winning Rancho Sahuarita community. Original owners, pride of ownership shines! Seller financed solar panel system will be paid off by seller at COE, will convey to new owners free and clear!! Monthly $128 HOA dues include stocked lake, water park including pool, lap pool, satellite pool, access to Clubhouse, fitness center, ''Safari Park'', tennis court, basketball sports court, paved bike/jogging trails, sidewalks and numerous grass dog parks. Located minutes from schools, shopping, groceries, restaurants and quick access to I-10. Featuring: E/W orientation, concrete flat tile roof, concrete driveway, concrete sidewalks, on and off street parking, irrigation drip system (front & back), granite rip rap, native plants, covered front patio and security door.\nInside buyers will appreciate energy efficient double pane windows, custom white blinds, modern ceiling fans in all bedrooms, tall painted ceilings (no popcorn), recessed lighting, 9' interior doors, brushed nickel hardware, gas HVAC, Nest smart thermostat, internal laundry and plumbed for water softener. Entertainers dream w/massive tiled great room adjacent to open concept kitchen w/full slab quartz island and matching quartz counter tops, bar seating, modern white kitchen cabinets, stainless steel appliance package, gas stove, built-in microwave, large metal sink, pendant lighting and closet pantry. Spacious primary bedroom features walk-in closet ensuite full bathroom with executive height dual sink modern wood vanity and walk-in shower.\nEnjoy tranquil backyard with no neighbors behind providing unobstructed panoramic Santa Rita mountain range and Madera Canyon views, extended covered patio on concrete, plumbed for gas for grill, native plants surrounded by privacy block walls and view fencing to the East.\nLocated walking distance to one of the community pools, call to make your appointment to view this beautiful home today!!"
    }
  ]
}