{
  "invalid": [
    {
      "id": "BeNtnl24hgRpMM9mxTM8",
      "address": "208 Weaver Ave",
      "city": "lake wales",
      "state": "FL",
      "zipCode": "Step into Lake Wales history with this beautifully renovated 100-year-old charmer. Blending timeless character with modern upgrades, this home features a stunning new kitchen with stainless steel appliances, GRANITE countertops, and updated cabinetry. You'll also find newer A/C, energy-efficient windows, water heater, updated flooring, lighting, and fixtures throughout.    Relax by the cozy wood-burning FIREPLACE, with the primary bedroom and oversized laundry room thoughtfully located on the main floor. Outside, enjoy the spacious COVERED FRONT PORCH, fresh landscaping, A BRAND NEW ROOF, and a FENCED backyard complete with a firepit and RV PARKING with full hookups.    CENTRALLY LOCATED— walking distance from Downtown, near dining, shopping, and major highways 27 & 60. USDA and OWNER FINANCING available for qualified buyers.    If you're looking for a home that TELLS A STORY — this is the one !",
      "isActive": true
    },
    {
      "id": "LU6ST07Zxbm1UMyMif1K",
      "address": "718 N Union St",
      "city": "whitesboro",
      "state": "TX",
      "zipCode": "**INVESTOR SPECIAL** This property presents an excellent investment opportunity for savvy real estate investors. Featuring 3 bedrooms, 2 bathrooms, and a dedicated office space, this home sits on an oversized lot, offering ample potential for future enhancements or expansion. Some upgrades have already been completed, providing a solid foundation for further value-add improvements.\n\nThe property is being sold **as is**, allowing buyers the flexibility to renovate or customize according to their vision. CASH ONLY OR **Seller financing is available**, making this an accessible option for investors seeking alternative purchasing solutions.\n\nLocated in close proximity to both a popular casino and a scenic lake, this property offers attractive lifestyle and rental appeal. Don’t miss out on this investor special—unlock the potential and maximize your returns in a desirable area!\n\nNo sign in the yard!",
      "isActive": true
    },
    {
      "id": "MtAFWInNZwI0ZmAaeBZ9",
      "address": "407 N Dallas St",
      "city": "rice",
      "state": "TX",
      "zipCode": "OPEN HOUSE 8--4 to 8-10 10AM-2PM  NOW OFFERING SELLER FINANCING! Contact the agent for more details. Experience comfort, style, and ease in this beautifully new 3-bedroom, 2-bath home in the charming town of Rice. Designed for modern living, it\nfeatures a bright, open floor plan perfect for both relaxing and entertaining. The kitchen boasts sleek countertops and plenty of cabinet space, ideal for everyday cooking or hosting guests. The spacious primary suite includes a private ensuite bathroom and walk-in closet, while two additional bedrooms provide flexibility for a guest room or home office. Built with energy efficiency and low-maintenance living in mind, this home offers all the perks of new construction without the wait. Enjoy the generous backyard—perfect for outdoor fun, gardening, or peaceful evenings under the Texas sky. Conveniently located just minutes from I-45, commuting to nearby cities is easy while still enjoying the tranquility of small-town life.",
      "isActive": true
    },
    {
      "id": "OjgdPknUjhUSIqT87lkN",
      "address": "1400 s lee circle",
      "city": "blytheville",
      "state": "AR",
      "zipCode": "Needs about 15-20k in rehab",
      "isActive": true
    },
    {
      "id": "USYRLt7dZnLG3WjgdXUx",
      "address": "2983 Point St",
      "city": "north port",
      "state": "FL",
      "zipCode": "Welcome to this beautifully updated three-bedroom, two-bath ranch-style home that perfectly combines modern comfort with timeless charm. The recently remodeled kitchen and bathrooms provide a fresh, contemporary ambiance, and the home is fully equipped with all kitchen appliances—including a refrigerator less than a year old—plus a washer and dryer. Granite countertops add a touch of luxury throughout, and a full laundry room provides added convenience. Elegant tray ceilings bring architectural interest, while a built-in security system offers peace of mind. The roof is less than a year old, giving buyers confidence in long-term durability. Additional highlights include an oversized garage with ample space for parking and storage. An additional rear lot is also available for purchase, offering even more potential to make this property truly your own. Possible owner financing as low as 6. Owner is real agent.",
      "isActive": true
    },
    {
      "id": "WFbaLReez5s3fLTAfAy5",
      "address": "19173 Greenleaf Dr",
      "city": "flint",
      "state": "TX",
      "zipCode": "New Roof July 2025 and new HVAC August 2025 - located just off HWY 69 in a highly sought-after East Texas neighborhood, this 3-bedroom, 2-bathroom home offers the perfect mix of privacy and convenience. Just five minutes from Broadway Avenue, you’ll have quick access to top restaurants, shopping, grocery stores, and more. The interior has been freshly painted with light updates throughout, creating a clean and refreshed feel. Inside, the home features 10-foot ceilings in the spacious living room, a cozy fireplace, and durable tile flooring throughout most of the home. The primary suite includes dual closets for added comfort and functionality. Outside, the large fully fenced backyard with mature trees provides extra space, shade, and privacy, ideal for gatherings, pets, or play. This home combines neighborhood charm with city convenience, and owner financing is available.",
      "isActive": true
    },
    {
      "id": "WYKyNVsg7MSzSYndPmsR",
      "address": "304 Highway 98",
      "city": "carrabelle",
      "state": "FL",
      "zipCode": "Seller Financing Available! Step into a piece of history with this beautifully remodeled 1930s home located in the heart of charming Carrabelle, Florida. This thoughtfully updated residence blends classic character with modern comforts. Inside, you'll find a spacious primary suite with a private bath, open concept kitchen perfect for entertaining. The renovation preserves the home's vintage charm while adding stylish, up to date finishes. Schedule your showing with us today.",
      "isActive": true
    },
    {
      "id": "YgyXflNomI5cNYxoM9G1",
      "address": "4545 Fairway Oaks Dr",
      "city": "mulberry",
      "state": "FL",
      "zipCode": "One or more photo(s) has been virtually staged. BRAND NEW HOME!**Stunning Lake View Lot in Fairway Oaks—Move-In Ready!** Discover your dream home in the picturesque Reserves of Fairway Oaks! This beautiful lake view lot offers a serene setting with no backyard neighbors, perfect for family living. Step inside the open-concept design, where you'll be greeted by a grand foyer showcasing stunning tray ceiling views, flowing seamlessly into the living room and master suite. The chef's kitchen is a highlight, featuring 42-inch cabinets with elegant glass uppers and lighting, soft-close drawers, and brand-new stainless steel appliances. Enjoy breathtaking water views from the kitchen, living area, and master bedroom, making every moment at home special. This thoughtfully designed split-bedroom home includes a versatile flex room, ideal for a home office or additional family space, accompanied by a convenient half bath. The owner's suite is a true retreat, boasting two separate walk-in closets and an en-suite bathroom complete with double vanities, a spacious walk-in shower, and beautiful beehive tiles. The luxurious granite finishes add an extra touch of elegance. On the opposite side of the owner's suite, you'll find two additional bedrooms sharing a well-appointed Jack and Jill bathroom. This new construction is nestled in an established gated community, combining modern features with a welcoming atmosphere—perfect whether it’s your first home or a forever retreat. The seller is offering concessions for buyers, and owner financing is available. Don’t miss out on this incredible opportunity—call for more details and make this beautiful home yours today!",
      "isActive": true
    },
    {
      "id": "fSrkcstAZqaRSz4xIJ8G",
      "address": "3406 Mesquite Dr",
      "city": "sugar land",
      "state": "TX",
      "zipCode": "Two-story brick home with covered front porch, detached two-car garage, and extended driveway with parking for multiple cars or trucks. Interior includes high-ceiling living room, formal dining area, front guest room, and kitchen with center island cooktop, breakfast area, microwave, Samsung dishwasher, and refrigerator with water and ice dispenser. Primary bedroom on first floor features walk-in closet, walk-in shower, soaking tub, and double-door access to porch. Upstairs, the space offers two bedrooms and a game room. Laundry area with washer and dryer included. High-efficiency central HVAC. Public water and sewer. All room sizes are approximate and should be verified by the buyer’s agent. Owner financing available for qualified buyers. #RATED A - SCHOOL DISTRICT",
      "isActive": true
    },
    {
      "id": "fcH5UooCLK8HsIiaWpv6",
      "address": "219 Hillcrest St",
      "city": "sanger",
      "state": "TX",
      "zipCode": "Beautiful fully renovated home with a brand New Roof! It features an open floor plan with a great backyard for entertaining. Come check out this rare gem in downtown Sanger. HVAC (2019). Seller Financing is available.",
      "isActive": true
    },
    {
      "id": "jpohoNbkHkJVXtqXUHgq",
      "address": "136 Allington Cir",
      "city": "jarrell",
      "state": "TX",
      "zipCode": "Welcome to this spacious 4-bedroom, 2-bathroom home, nestled in a neighborhood that combines comfort with convenience. The open floor plan allows for effortless flow, ideal for everyday living. Each of the four generously sized bedrooms offers ample closet space, ensuring a sanctuary for every member of your family. The heart of the home is the inviting kitchen, equipped with stainless appliances and abundant cabinetry, perfect for culinary adventures and casual dining. Granite countertops throughout the home. Newly installed carpet and laminate flooring in the living room, kitchen, and front bedroom. Water heater and water softener recently renewed. Strategically located, this home is just minutes away from local schools and shopping centers, providing a balance of peaceful living and urban accessibility. Easy access to I-35 and just a short drive south to Georgetown or north to Salado-Belton. No neighbors behind you. Almost country living! Don't miss the opportunity to make this wonderful property your new home.",
      "isActive": true
    },
    {
      "id": "lGS4PO4jyoQQcdWdxCFh",
      "address": "2460 French St",
      "city": "fate",
      "state": "TX",
      "zipCode": "Owner Financing Only – no hidden lender fees or extra approval steps required. Just 20% down, 10% interest, and a 30-year note makes owning this home simple and straightforward! Move-In Ready & Full of Space! Discover this beautifully maintained 2,620 sq ft home in the sought-after Woodcreek community of Fate. Offering 5 bedrooms, 2.5 baths, and two generous living areas, there’s plenty of room for the entire family to spread out and enjoy. This charming brick home features low-maintenance landscaping and a convenient front-facing two-car garage. Step inside to bright, open-concept living, dining, and kitchen spaces—ideal for both everyday living and entertaining. The neutral color palette and thoughtful updates throughout create a warm, modern feel. The kitchen is the heart of the home, complete with a central island, granite countertops, white cabinetry, and abundant storage. A downstairs half bath is perfect for guests, and the spacious primary suite offers a cozy sitting area, walk-in closet, and ensuite bath with a large shower and built-in shelving. Upstairs, a second living area makes a great game room, media space, or kids’ retreat. You’ll also find four additional bedrooms and a shared full bath. Enjoy outdoor living with a covered back patio and a large yard—ideal for a playset or trampoline. Woodcreek residents enjoy access to community amenities including a pool, playgrounds, jogging trails, and more. Plus, you're just minutes from the local elementary school!",
      "isActive": true
    },
    {
      "id": "lsAOLsT8G0vaznzQo4r9",
      "address": "6812 Lakeside Dr",
      "city": "lake worth",
      "state": "TX",
      "zipCode": "Investor special or DIY dream! Can Owner Finance home short-term for flip or long-term for 30 years. This 3-bedroom, 1-bath home sits on a spacious lot that backs up to open land, offering privacy and plenty of space. While the property needs significant repairs, it has solid potential for the right buyer to bring it back to life. In addition to the main house, there's a small detached apartment in the back—perfect for a guest suite, rental income, or extended family. It needs renovation but could be a great bonus living space with a little work. Whether you're an investor looking for your next project or a homeowner ready to roll up your sleeves and customize your dream space, this property offers great value and opportunity. Owner financing available either short term for a flip or longer term for homestead. Don't miss out on this chance to turn a fixer-upper into something truly special! All major big ticket items need work. Please be careful walking around home!",
      "isActive": true
    },
    {
      "id": "mT1a3NbMTl3u6tdGtjtp",
      "address": "20810 Trenton Valley Ln",
      "city": "katy",
      "state": "TX",
      "zipCode": "Welcome to this spacious 4-bedroom, 2.5-bath home nestled in a well-established and highly sought-after community. Offering an abundance of space both inside and out, this home is perfect for families, entertaining, or simply spreading out and enjoying comfortable living.\nThe main level features a bright and open layout with generous living and dining areas, a well-appointed kitchen, and a cozy family room—ideal for gatherings or quiet evenings at home. Upstairs, you’ll find four generously sized bedrooms, including a serene primary suite with its own private bath and ample closet space.",
      "isActive": true
    },
    {
      "id": "pWRgLkuD5sg0JTBxFVYx",
      "address": "147 Western Lake Dr",
      "city": "weatherford",
      "state": "TX",
      "zipCode": "Looking to get away? Looking to leave the hustle and bustle of the DFW but be within touching distance to access the metroplex ONLY when you want to? Well, this is the home for you. With access to a nearby lake, this home sits on a corner lot of over 1.3 acres. Recently updated, this cozy home comes with 3 bedrooms, 2 bathrooms, and a utility room. And no, this home is NOT a mobile home or a manufactured home. Improvements include a new septic system. The kitchen showcases quartz countertops with new appliances and new cabinets. Both bathrooms include stand up showers adorned with beautifully tiled walls. This property is priced to sell and is open to creative solutions including buyer concessions to make this home yours.\n\nOWNER FINANCING ONLY! PROPERTY IS ALSO LISTED FOR LEASE. LEASE TO OWN OPPORTUNITY ALSO AVAILABLE. NEW WIRE FENCING TO BE ADDED ON A DECENT OFFER",
      "isActive": true
    },
    {
      "id": "rcuP9y5jXJe58nk6I7Vt",
      "address": "509 N 6th St",
      "city": "donna",
      "state": "TX",
      "zipCode": "Discover this charming 4-bedroom, 2.5-bath farmhouse-style home with a spacious front porch and fully fenced front and back yards, perfect for privacy and outdoor living. Located in a family-friendly neighborhood just minutes from the expressway, it also features a covered backyard area ideal for BBQs and gatherings. Easy financing available — 0% down for qualified buyers OR owner financing with just 15% down, 10% interest, and a 20-year term!",
      "isActive": true
    },
    {
      "id": "up7ri2TB8SRfwTraIN9G",
      "address": "206 E Gilmer St",
      "city": "rice",
      "state": "TX",
      "zipCode": "OPEN HOUSE 8--4 to 8-10 10AM-2PM, NOW OFFERING SELLER FINANCING! Contact the agent for more details. Experience comfort, style, and ease in this beautifully new 3-bedroom, 2-bath home in the charming town of Rice. Designed for modern living, it features a bright, open floor plan perfect for both relaxing and entertaining. The kitchen boasts sleek countertops and plenty of cabinet space, ideal for everyday cooking or hosting guests. The spacious primary suite includes a private ensuite bathroom and walk-in closet, while two additional bedrooms provide flexibility for a guest room or home office. Built with energy efficiency and low-maintenance living in mind, this home offers all the perks of new construction without the wait. Enjoy the generous backyardperfect for outdoor fun, gardening, or peaceful evenings under the Texas sky. Conveniently located just minutes from I-45, commuting to nearby cities is easy while still enjoying the tranquility of small-town life.",
      "isActive": true
    }
  ],
  "missing": [
    {
      "id": "Qo882DwvYAxuonMz2PtZ",
      "address": "112 spring valley",
      "city": "adkins",
      "state": "TX",
      "zipCode": "(empty)",
      "isActive": true
    }
  ],
  "timestamp": "2025-11-14T16:40:50.781Z"
}